export const REGIONS = [
  {
    city: "Адыгейск",
    lat: "44.8783715",
    lon: "39.190172",
  },
  {
    city: "Майкоп",
    lat: "44.6098268",
    lon: "40.1006527",
  },
  {
    city: "Горно-Алтайск",
    lat: "51.9582681",
    lon: "85.9602957",
  },
  {
    city: "Алейск",
    lat: "52.4920914",
    lon: "82.7794145",
  },
  {
    city: "Барнаул",
    lat: "53.3481145",
    lon: "83.7798362",
  },
  {
    city: "Белокуриха",
    lat: "51.9960534",
    lon: "84.9840343",
  },
  {
    city: "Бийск",
    lat: "52.5393683",
    lon: "85.2138852",
  },
  {
    city: "Горняк",
    lat: "50.9979032",
    lon: "81.4643059",
  },
  {
    city: "Заринск",
    lat: "53.7063495",
    lon: "84.9314703",
  },
  {
    city: "Змеиногорск",
    lat: "51.1580235",
    lon: "82.1872476",
  },
  {
    city: "Камень-на-Оби",
    lat: "53.7915454",
    lon: "81.3545173",
  },
  {
    city: "Новоалтайск",
    lat: "53.4120811",
    lon: "83.9311249",
  },
  {
    city: "Рубцовск",
    lat: "51.5013075",
    lon: "81.2077729",
  },
  {
    city: "Славгород",
    lat: "52.9993053",
    lon: "78.6459674",
  },
  {
    city: "Яровое",
    lat: "52.9251728",
    lon: "78.5729898",
  },
  {
    city: "Белогорск",
    lat: "50.9212235",
    lon: "128.4738742",
  },
  {
    city: "Благовещенск",
    lat: "50.2905935",
    lon: "127.5272186",
  },
  {
    city: "Завитинск",
    lat: "50.1064678",
    lon: "129.4392897",
  },
  {
    city: "Зея",
    lat: "53.7339151",
    lon: "127.2658079",
  },
  {
    city: "Райчихинск",
    lat: "49.7941882",
    lon: "129.4112149",
  },
  {
    city: "Свободный",
    lat: "51.361264",
    lon: "128.1218995",
  },
  {
    city: "Сковородино",
    lat: "53.9871004",
    lon: "123.943729",
  },
  {
    city: "Тында",
    lat: "55.1546401",
    lon: "124.7468634",
  },
  {
    city: "Циолковский",
    lat: "51.7624346",
    lon: "128.121972",
  },
  {
    city: "Шимановск",
    lat: "52.0052856",
    lon: "127.7006559",
  },
  {
    city: "Архангельск",
    lat: "64.5392985",
    lon: "40.5170083",
  },
  {
    city: "Вельск",
    lat: "61.0660057",
    lon: "42.1032858",
  },
  {
    city: "Каргополь",
    lat: "61.5008762",
    lon: "38.9636415",
  },
  {
    city: "Коряжма",
    lat: "61.2885993",
    lon: "47.1002315",
  },
  {
    city: "Котлас",
    lat: "61.2529842",
    lon: "46.6331915",
  },
  {
    city: "Мезень",
    lat: "65.8398386",
    lon: "44.2531865",
  },
  {
    city: "Мирный",
    lat: "62.7644267",
    lon: "40.3359976",
  },
  {
    city: "Новодвинск",
    lat: "64.4136023",
    lon: "40.8208003",
  },
  {
    city: "Няндома",
    lat: "61.6653735",
    lon: "40.2061699",
  },
  {
    city: "Онега",
    lat: "63.9163966",
    lon: "38.0805749",
  },
  {
    city: "Северодвинск",
    lat: "64.56253",
    lon: "39.8182715",
  },
  {
    city: "Сольвычегодск",
    lat: "61.3318091",
    lon: "46.920351",
  },
  {
    city: "Шенкурск",
    lat: "62.1057423",
    lon: "42.89959",
  },
  {
    city: "Астрахань",
    lat: "46.3655808",
    lon: "48.0559979",
  },
  {
    city: "Ахтубинск",
    lat: "48.2753078",
    lon: "46.1906741",
  },
  {
    city: "Знаменск",
    lat: "48.5865618",
    lon: "45.7367908",
  },
  {
    city: "Камызяк",
    lat: "46.1105429",
    lon: "48.0732724",
  },
  {
    city: "Нариманов",
    lat: "46.6916597",
    lon: "47.8501624",
  },
  {
    city: "Харабали",
    lat: "47.4089187",
    lon: "47.2524467",
  },
  {
    city: "Агидель",
    lat: "55.89976",
    lon: "53.9221149",
  },
  {
    city: "Баймак",
    lat: "52.5912632",
    lon: "58.3111995",
  },
  {
    city: "Белебей",
    lat: "54.1033832",
    lon: "54.1111878",
  },
  {
    city: "Белорецк",
    lat: "53.9675927",
    lon: "58.4099562",
  },
  {
    city: "Бирск",
    lat: "55.4157107",
    lon: "55.5582335",
  },
  {
    city: "Давлеканово",
    lat: "54.2227617",
    lon: "55.0313419",
  },
  {
    city: "Дюртюли",
    lat: "55.4848047",
    lon: "54.8524875",
  },
  {
    city: "Ишимбай",
    lat: "53.4546314",
    lon: "56.043874",
  },
  {
    city: "Кумертау",
    lat: "52.7565537",
    lon: "55.7969915",
  },
  {
    city: "Межгорье",
    lat: "54.239683",
    lon: "57.96146",
  },
  {
    city: "Мелеуз",
    lat: "52.9590637",
    lon: "55.9283483",
  },
  {
    city: "Нефтекамск",
    lat: "56.0883075",
    lon: "54.2483391",
  },
  {
    city: "Октябрьский",
    lat: "54.4815344",
    lon: "53.4656611",
  },
  {
    city: "Салават",
    lat: "53.3616311",
    lon: "55.9245559",
  },
  {
    city: "Сибай",
    lat: "52.7205811",
    lon: "58.6663303",
  },
  {
    city: "Стерлитамак",
    lat: "53.6302498",
    lon: "55.9315707",
  },
  {
    city: "Туймазы",
    lat: "54.5999889",
    lon: "53.6949081",
  },
  {
    city: "Уфа",
    lat: "54.734853",
    lon: "55.9578647",
  },
  {
    city: "Учалы",
    lat: "54.3066965",
    lon: "59.4126559",
  },
  {
    city: "Янаул",
    lat: "56.2650336",
    lon: "54.9298314",
  },
  {
    city: "Алексеевка",
    lat: "50.6299932",
    lon: "38.6881776",
  },
  {
    city: "Белгород",
    lat: "50.5977351",
    lon: "36.5858236",
  },
  {
    city: "Бирюч",
    lat: "50.6483899",
    lon: "38.4006203",
  },
  {
    city: "Валуйки",
    lat: "50.2112799",
    lon: "38.0998765",
  },
  {
    city: "Грайворон",
    lat: "50.4862699",
    lon: "35.6662957",
  },
  {
    city: "Губкин",
    lat: "51.2836362",
    lon: "37.5347608",
  },
  {
    city: "Короча",
    lat: "50.8130123",
    lon: "37.1896543",
  },
  {
    city: "Новый Оскол",
    lat: "50.7635162",
    lon: "37.8774026",
  },
  {
    city: "Старый Оскол",
    lat: "51.2965991",
    lon: "37.8349849",
  },
  {
    city: "Строитель",
    lat: "50.7845571",
    lon: "36.4886619",
  },
  {
    city: "Шебекино",
    lat: "50.4005506",
    lon: "36.8877988",
  },
  {
    city: "Брянск",
    lat: "53.2420071",
    lon: "34.3652716",
  },
  {
    city: "Дятьково",
    lat: "53.5958283",
    lon: "34.355092",
  },
  {
    city: "Жуковка",
    lat: "53.5341219",
    lon: "33.7302166",
  },
  {
    city: "Злынка",
    lat: "52.4265906",
    lon: "31.7360386",
  },
  {
    city: "Карачев",
    lat: "53.1297194",
    lon: "34.9887859",
  },
  {
    city: "Клинцы",
    lat: "52.7529052",
    lon: "32.2339161",
  },
  {
    city: "Мглин",
    lat: "53.0600644",
    lon: "32.8467217",
  },
  {
    city: "Новозыбков",
    lat: "52.5371426",
    lon: "31.9356826",
  },
  {
    city: "Почеп",
    lat: "52.9154724",
    lon: "33.4744608",
  },
  {
    city: "Севск",
    lat: "52.1484215",
    lon: "34.4918198",
  },
  {
    city: "Сельцо",
    lat: "53.3738801",
    lon: "34.1059226",
  },
  {
    city: "Стародуб",
    lat: "52.5851881",
    lon: "32.7603628",
  },
  {
    city: "Сураж",
    lat: "53.0171239",
    lon: "32.3938351",
  },
  {
    city: "Трубчевск",
    lat: "52.5791314",
    lon: "33.7660013",
  },
  {
    city: "Унеча",
    lat: "52.8460665",
    lon: "32.6757071",
  },
  {
    city: "Фокино",
    lat: "53.4554552",
    lon: "34.4158537",
  },
  {
    city: "Бабушкин",
    lat: "51.7113066",
    lon: "105.8673633",
  },
  {
    city: "Гусиноозерск",
    lat: "51.2865751",
    lon: "106.5230732",
  },
  {
    city: "Закаменск",
    lat: "50.3726774",
    lon: "103.2867452",
  },
  {
    city: "Кяхта",
    lat: "50.3466291",
    lon: "106.4534938",
  },
  {
    city: "Северобайкальск",
    lat: "55.6357165",
    lon: "109.3362606",
  },
  {
    city: "Улан-Удэ",
    lat: "51.8334378",
    lon: "107.5841511",
  },
  {
    city: "Александров",
    lat: "56.3919652",
    lon: "38.711035",
  },
  {
    city: "Владимир",
    lat: "56.1281561",
    lon: "40.4082995",
  },
  {
    city: "Вязники",
    lat: "56.2976528",
    lon: "42.2687311",
  },
  {
    city: "Гороховец",
    lat: "56.2021059",
    lon: "42.692517",
  },
  {
    city: "Гусь-Хрустальный",
    lat: "55.6198065",
    lon: "40.6578769",
  },
  {
    city: "Камешково",
    lat: "56.3488712",
    lon: "40.9955682",
  },
  {
    city: "Карабаново",
    lat: "56.3133447",
    lon: "38.7034267",
  },
  {
    city: "Киржач",
    lat: "56.1485263",
    lon: "38.8635035",
  },
  {
    city: "Ковров",
    lat: "56.3553895",
    lon: "41.3169568",
  },
  {
    city: "Кольчугино",
    lat: "56.3327616",
    lon: "39.391201",
  },
  {
    city: "Костерево",
    lat: "55.9336424",
    lon: "39.624822",
  },
  {
    city: "Курлово",
    lat: "55.4525994",
    lon: "40.6124362",
  },
  {
    city: "Лакинск",
    lat: "56.0180614",
    lon: "39.9564706",
  },
  {
    city: "Меленки",
    lat: "55.3387017",
    lon: "41.634124",
  },
  {
    city: "Муром",
    lat: "55.5632276",
    lon: "42.023006",
  },
  {
    city: "Петушки",
    lat: "55.9297657",
    lon: "39.4507913",
  },
  {
    city: "Покров",
    lat: "55.9167118",
    lon: "39.1733641",
  },
  {
    city: "Радужный",
    lat: "55.9961034",
    lon: "40.3323247",
  },
  {
    city: "Собинка",
    lat: "55.993798",
    lon: "40.0180034",
  },
  {
    city: "Струнино",
    lat: "56.3750001",
    lon: "38.583938",
  },
  {
    city: "Судогда",
    lat: "55.949897",
    lon: "40.8563392",
  },
  {
    city: "Суздаль",
    lat: "56.4273814",
    lon: "40.4525581",
  },
  {
    city: "Юрьев-Польский",
    lat: "56.4938067",
    lon: "39.6679311",
  },
  {
    city: "Волгоград",
    lat: "48.7072005",
    lon: "44.5170207",
  },
  {
    city: "Волжский",
    lat: "48.7978483",
    lon: "44.7462417",
  },
  {
    city: "Дубовка",
    lat: "49.0555342",
    lon: "44.8270813",
  },
  {
    city: "Жирновск",
    lat: "50.9767561",
    lon: "44.7857694",
  },
  {
    city: "Калач-на-Дону",
    lat: "48.6887569",
    lon: "43.5306866",
  },
  {
    city: "Камышин",
    lat: "50.0651261",
    lon: "45.3843816",
  },
  {
    city: "Котельниково",
    lat: "47.6310808",
    lon: "43.1331198",
  },
  {
    city: "Котово",
    lat: "50.3205433",
    lon: "44.8031864",
  },
  {
    city: "Краснослободск",
    lat: "48.7068777",
    lon: "44.5631799",
  },
  {
    city: "Ленинск",
    lat: "48.6936234",
    lon: "45.1992835",
  },
  {
    city: "Михайловка",
    lat: "50.0708749",
    lon: "43.2400847",
  },
  {
    city: "Николаевск",
    lat: "50.0166952",
    lon: "45.4733204",
  },
  {
    city: "Новоаннинский",
    lat: "50.5296873",
    lon: "42.6666038",
  },
  {
    city: "Палласовка",
    lat: "50.0501422",
    lon: "46.8803355",
  },
  {
    city: "Петров Вал",
    lat: "50.1380355",
    lon: "45.2091455",
  },
  {
    city: "Серафимович",
    lat: "49.566286",
    lon: "42.7360013",
  },
  {
    city: "Суровикино",
    lat: "48.6189756",
    lon: "42.8541308",
  },
  {
    city: "Урюпинск",
    lat: "50.7904767",
    lon: "42.0288589",
  },
  {
    city: "Фролово",
    lat: "49.7647809",
    lon: "43.6648936",
  },
  {
    city: "Бабаево",
    lat: "59.389309",
    lon: "35.9378318",
  },
  {
    city: "Белозерск",
    lat: "60.0307914",
    lon: "37.7891123",
  },
  {
    city: "Великий Устюг",
    lat: "60.7603243",
    lon: "46.3053893",
  },
  {
    city: "Вологда",
    lat: "59.2484186",
    lon: "39.8356461",
  },
  {
    city: "Вытегра",
    lat: "61.0064157",
    lon: "36.4495835",
  },
  {
    city: "Грязовец",
    lat: "58.8757657",
    lon: "40.248477",
  },
  {
    city: "Кадников",
    lat: "59.5037947",
    lon: "40.3440473",
  },
  {
    city: "Кириллов",
    lat: "59.8590353",
    lon: "38.3749854",
  },
  {
    city: "Красавино",
    lat: "60.9613991",
    lon: "46.481465",
  },
  {
    city: "Никольск",
    lat: "59.5350162",
    lon: "45.4575468",
  },
  {
    city: "Сокол",
    lat: "59.4759156",
    lon: "40.1114414",
  },
  {
    city: "Тотьма",
    lat: "59.9735051",
    lon: "42.7589701",
  },
  {
    city: "Устюжна",
    lat: "58.8383671",
    lon: "36.4425046",
  },
  {
    city: "Харовск",
    lat: "59.9477728",
    lon: "40.2000794",
  },
  {
    city: "Череповец",
    lat: "59.1269214",
    lon: "37.9092243",
  },
  {
    city: "Бобров",
    lat: "51.0902048",
    lon: "40.0320014",
  },
  {
    city: "Богучар",
    lat: "49.9352997",
    lon: "40.5592467",
  },
  {
    city: "Борисоглебск",
    lat: "51.3654619",
    lon: "42.100947",
  },
  {
    city: "Бутурлиновка",
    lat: "50.8313227",
    lon: "40.5977541",
  },
  {
    city: "Воронеж",
    lat: "51.6592378",
    lon: "39.1968284",
  },
  {
    city: "Калач",
    lat: "50.4241213",
    lon: "41.0162858",
  },
  {
    city: "Лиски",
    lat: "50.9944734",
    lon: "39.518302",
  },
  {
    city: "Нововоронеж",
    lat: "51.3092463",
    lon: "39.2162865",
  },
  {
    city: "Новохоперск",
    lat: "51.0953461",
    lon: "41.6173714",
  },
  {
    city: "Острогожск",
    lat: "50.8678083",
    lon: "39.0406398",
  },
  {
    city: "Павловск",
    lat: "50.4533684",
    lon: "40.1369087",
  },
  {
    city: "Поворино",
    lat: "51.1953446",
    lon: "42.2472432",
  },
  {
    city: "Россошь",
    lat: "50.170089",
    lon: "39.6225534",
  },
  {
    city: "Семилуки",
    lat: "51.6951846",
    lon: "39.0189797",
  },
  {
    city: "Эртиль",
    lat: "51.831024",
    lon: "40.8074054",
  },
  {
    city: "Буйнакск",
    lat: "42.8213799",
    lon: "47.1164452",
  },
  {
    city: "Дагестанские Огни",
    lat: "42.1151021",
    lon: "48.1939983",
  },
  {
    city: "Дербент",
    lat: "42.058935",
    lon: "48.2908653",
  },
  {
    city: "Избербаш",
    lat: "42.565098",
    lon: "47.871002",
  },
  {
    city: "Каспийск",
    lat: "42.8916599",
    lon: "47.6366674",
  },
  {
    city: "Кизилюрт",
    lat: "43.2039094",
    lon: "46.8729311",
  },
  {
    city: "Кизляр",
    lat: "43.8483915",
    lon: "46.7232828",
  },
  {
    city: "Махачкала",
    lat: "42.9848572",
    lon: "47.5046303",
  },
  {
    city: "Хасавюрт",
    lat: "43.2505191",
    lon: "46.5852276",
  },
  {
    city: "Южно-Сухокумск",
    lat: "44.6600972",
    lon: "45.6499304",
  },
  {
    city: "Биробиджан",
    lat: "48.7945975",
    lon: "132.9217594",
  },
  {
    city: "Облучье",
    lat: "49.0188344",
    lon: "131.0539984",
  },
  {
    city: "Балей",
    lat: "51.5822063",
    lon: "116.6380088",
  },
  {
    city: "Борзя",
    lat: "50.3875437",
    lon: "116.5235682",
  },
  {
    city: "Краснокаменск",
    lat: "50.092858",
    lon: "118.0323407",
  },
  {
    city: "Могоча",
    lat: "53.7362465",
    lon: "119.7661232",
  },
  {
    city: "Нерчинск",
    lat: "51.9595512",
    lon: "116.5854018",
  },
  {
    city: "Петровск-Забайкальский",
    lat: "51.2748381",
    lon: "108.8467139",
  },
  {
    city: "Сретенск",
    lat: "52.2462356",
    lon: "117.7116971",
  },
  {
    city: "Хилок",
    lat: "51.3635236",
    lon: "110.458989",
  },
  {
    city: "Чита",
    lat: "52.0340128",
    lon: "113.4994884",
  },
  {
    city: "Шилка",
    lat: "51.8495302",
    lon: "116.033575",
  },
  {
    city: "Вичуга",
    lat: "57.2044545",
    lon: "41.9131192",
  },
  {
    city: "Гаврилов Посад",
    lat: "56.5585967",
    lon: "40.1228288",
  },
  {
    city: "Заволжск",
    lat: "57.4916546",
    lon: "42.1374455",
  },
  {
    city: "Иваново",
    lat: "56.9994677",
    lon: "40.9728231",
  },
  {
    city: "Кинешма",
    lat: "57.4425441",
    lon: "42.1690039",
  },
  {
    city: "Комсомольск",
    lat: "57.0273907",
    lon: "40.3775952",
  },
  {
    city: "Кохма",
    lat: "56.9325151",
    lon: "41.0933071",
  },
  {
    city: "Наволоки",
    lat: "57.4678426",
    lon: "41.9607371",
  },
  {
    city: "Плес",
    lat: "57.4605304",
    lon: "41.512301",
  },
  {
    city: "Приволжск",
    lat: "57.3807249",
    lon: "41.2809239",
  },
  {
    city: "Пучеж",
    lat: "56.982075",
    lon: "43.1683878",
  },
  {
    city: "Родники",
    lat: "57.1024137",
    lon: "41.7298908",
  },
  {
    city: "Тейково",
    lat: "56.8542712",
    lon: "40.5355289",
  },
  {
    city: "Фурманов",
    lat: "57.2538043",
    lon: "41.1053808",
  },
  {
    city: "Шуя",
    lat: "56.8560743",
    lon: "41.3802455",
  },
  {
    city: "Южа",
    lat: "56.5926458",
    lon: "42.0457159",
  },
  {
    city: "Юрьевец",
    lat: "57.3178701",
    lon: "43.1110553",
  },
  {
    city: "Карабулак",
    lat: "43.3054762",
    lon: "44.9094521",
  },
  {
    city: "Магас",
    lat: "43.1686967",
    lon: "44.8130849",
  },
  {
    city: "Малгобек",
    lat: "43.5097009",
    lon: "44.5901517",
  },
  {
    city: "Назрань",
    lat: "43.2257977",
    lon: "44.764685",
  },
  {
    city: "Алзамай",
    lat: "55.5550493",
    lon: "98.6644106",
  },
  {
    city: "Ангарск",
    lat: "52.5448102",
    lon: "103.8885385",
  },
  {
    city: "Байкальск",
    lat: "51.5231282",
    lon: "104.1485752",
  },
  {
    city: "Бирюсинск",
    lat: "55.9608611",
    lon: "97.8203624",
  },
  {
    city: "Бодайбо",
    lat: "57.8468822",
    lon: "114.1867148",
  },
  {
    city: "Братск",
    lat: "56.1513951",
    lon: "101.6339892",
  },
  {
    city: "Вихоревка",
    lat: "56.1207708",
    lon: "101.170332",
  },
  {
    city: "Железногорск-Илимский",
    lat: "56.5847382",
    lon: "104.1141747",
  },
  {
    city: "Зима",
    lat: "53.9206865",
    lon: "102.0492066",
  },
  {
    city: "Иркутск",
    lat: "52.2863513",
    lon: "104.280655",
  },
  {
    city: "Киренск",
    lat: "57.7757126",
    lon: "108.1107766",
  },
  {
    city: "Нижнеудинск",
    lat: "54.8969105",
    lon: "99.0313481",
  },
  {
    city: "Саянск",
    lat: "54.1107787",
    lon: "102.1802563",
  },
  {
    city: "Свирск",
    lat: "53.0842576",
    lon: "103.3364192",
  },
  {
    city: "Слюдянка",
    lat: "51.6562679",
    lon: "103.7186877",
  },
  {
    city: "Тайшет",
    lat: "55.9405397",
    lon: "98.0030649",
  },
  {
    city: "Тулун",
    lat: "54.5571409",
    lon: "100.5779402",
  },
  {
    city: "Усолье-Сибирское",
    lat: "52.7567192",
    lon: "103.6387694",
  },
  {
    city: "Усть-Илимск",
    lat: "57.9431325",
    lon: "102.7414683",
  },
  {
    city: "Усть-Кут",
    lat: "56.7928049",
    lon: "105.7756883",
  },
  {
    city: "Черемхово",
    lat: "53.1369385",
    lon: "103.090119",
  },
  {
    city: "Шелехов",
    lat: "52.2102462",
    lon: "104.0973531",
  },
  {
    city: "Баксан",
    lat: "43.6820621",
    lon: "43.5345627",
  },
  {
    city: "Майский",
    lat: "43.6281779",
    lon: "44.0516663",
  },
  {
    city: "Нальчик",
    lat: "43.4846312",
    lon: "43.6070316",
  },
  {
    city: "Нарткала",
    lat: "43.5577208",
    lon: "43.8576411",
  },
  {
    city: "Прохладный",
    lat: "43.7589521",
    lon: "44.0101936",
  },
  {
    city: "Терек",
    lat: "43.4838439",
    lon: "44.1402524",
  },
  {
    city: "Тырныауз",
    lat: "43.3981939",
    lon: "42.9215127",
  },
  {
    city: "Чегем",
    lat: "43.5672039",
    lon: "43.5865338",
  },
  {
    city: "Багратионовск",
    lat: "54.3866976",
    lon: "20.6418545",
  },
  {
    city: "Балтийск",
    lat: "54.6514128",
    lon: "19.9141911",
  },
  {
    city: "Гвардейск",
    lat: "54.6588981",
    lon: "21.0500584",
  },
  {
    city: "Гурьевск",
    lat: "54.7705368",
    lon: "20.6039109",
  },
  {
    city: "Гусев",
    lat: "54.5915477",
    lon: "22.1944114",
  },
  {
    city: "Зеленоградск",
    lat: "54.9600226",
    lon: "20.4753274",
  },
  {
    city: "Калининград",
    lat: "54.7073218",
    lon: "20.5072458",
  },
  {
    city: "Краснознаменск",
    lat: "54.9452612",
    lon: "22.4928511",
  },
  {
    city: "Ладушкин",
    lat: "54.5693538",
    lon: "20.1691909",
  },
  {
    city: "Мамоново",
    lat: "54.4645591",
    lon: "19.9454114",
  },
  {
    city: "Неман",
    lat: "55.0315543",
    lon: "22.0323961",
  },
  {
    city: "Нестеров",
    lat: "54.6314454",
    lon: "22.5713658",
  },
  {
    city: "Озерск",
    lat: "54.4084804",
    lon: "22.013508",
  },
  {
    city: "Пионерский",
    lat: "54.9516927",
    lon: "20.227697",
  },
  {
    city: "Полесск",
    lat: "54.8626321",
    lon: "21.0998148",
  },
  {
    city: "Правдинск",
    lat: "54.4430604",
    lon: "21.0083638",
  },
  {
    city: "Приморск",
    lat: "54.7311185",
    lon: "19.9983108",
  },
  {
    city: "Светлогорск",
    lat: "54.9439566",
    lon: "20.1514789",
  },
  {
    city: "Светлый",
    lat: "54.6774051",
    lon: "20.1356625",
  },
  {
    city: "Славск",
    lat: "55.0451054",
    lon: "21.6742294",
  },
  {
    city: "Советск",
    lat: "55.0810474",
    lon: "21.8886272",
  },
  {
    city: "Черняховск",
    lat: "54.6243928",
    lon: "21.7969179",
  },
  {
    city: "Городовиковск",
    lat: "46.0875351",
    lon: "41.9354039",
  },
  {
    city: "Лагань",
    lat: "45.3929617",
    lon: "47.3432943",
  },
  {
    city: "Элиста",
    lat: "46.3082947",
    lon: "44.2701417",
  },
  {
    city: "Балабаново",
    lat: "55.1773652",
    lon: "36.6567255",
  },
  {
    city: "Белоусово",
    lat: "55.0957679",
    lon: "36.6777239",
  },
  {
    city: "Боровск",
    lat: "55.2130965",
    lon: "36.4927446",
  },
  {
    city: "Ермолино",
    lat: "55.1972714",
    lon: "36.5951966",
  },
  {
    city: "Жиздра",
    lat: "53.7522384",
    lon: "34.7386719",
  },
  {
    city: "Жуков",
    lat: "55.0301386",
    lon: "36.7393279",
  },
  {
    city: "Калуга",
    lat: "54.5060439",
    lon: "36.2515933",
  },
  {
    city: "Киров",
    lat: "54.0790823",
    lon: "34.3077508",
  },
  {
    city: "Козельск",
    lat: "54.0348417",
    lon: "35.7807136",
  },
  {
    city: "Кондрово",
    lat: "54.796051",
    lon: "35.9276099",
  },
  {
    city: "Кременки",
    lat: "54.8863306",
    lon: "37.116878",
  },
  {
    city: "Людиново",
    lat: "53.8701406",
    lon: "34.4385498",
  },
  {
    city: "Малоярославец",
    lat: "55.0176756",
    lon: "36.4632122",
  },
  {
    city: "Медынь",
    lat: "54.9690755",
    lon: "35.887313",
  },
  {
    city: "Мещовск",
    lat: "54.3191127",
    lon: "35.2816065",
  },
  {
    city: "Мосальск",
    lat: "54.4825589",
    lon: "34.987206",
  },
  {
    city: "Обнинск",
    lat: "55.0943892",
    lon: "36.6121785",
  },
  {
    city: "Сосенский",
    lat: "54.056525",
    lon: "35.9621458",
  },
  {
    city: "Спас-Деменск",
    lat: "54.4099201",
    lon: "34.0190263",
  },
  {
    city: "Сухиничи",
    lat: "54.0973787",
    lon: "35.3443077",
  },
  {
    city: "Таруса",
    lat: "54.7236791",
    lon: "37.1670866",
  },
  {
    city: "Юхнов",
    lat: "54.7445873",
    lon: "35.2424857",
  },
  {
    city: "Вилючинск",
    lat: "52.930428",
    lon: "158.4057276",
  },
  {
    city: "Елизово",
    lat: "53.1829573",
    lon: "158.3882833",
  },
  {
    city: "Петропавловск-Камчатский",
    lat: "53.0370213",
    lon: "158.6559142",
  },
  {
    city: "Карачаевск",
    lat: "43.773197",
    lon: "41.9143726",
  },
  {
    city: "Теберда",
    lat: "43.4438408",
    lon: "41.7414924",
  },
  {
    city: "Усть-Джегута",
    lat: "44.083852",
    lon: "41.971128",
  },
  {
    city: "Черкесск",
    lat: "44.2268637",
    lon: "42.0467829",
  },
  {
    city: "Беломорск",
    lat: "64.5378468",
    lon: "34.7799717",
  },
  {
    city: "Кемь",
    lat: "64.9543657",
    lon: "34.5948547",
  },
  {
    city: "Кондопога",
    lat: "62.2059866",
    lon: "34.2681778",
  },
  {
    city: "Костомукша",
    lat: "64.5889946",
    lon: "30.6015567",
  },
  {
    city: "Лахденпохья",
    lat: "61.5189466",
    lon: "30.199592",
  },
  {
    city: "Медвежьегорск",
    lat: "62.9127678",
    lon: "34.4567614",
  },
  {
    city: "Олонец",
    lat: "60.9793604",
    lon: "32.9726031",
  },
  {
    city: "Петрозаводск",
    lat: "61.78909",
    lon: "34.3596263",
  },
  {
    city: "Питкяранта",
    lat: "61.5756886",
    lon: "31.4641309",
  },
  {
    city: "Пудож",
    lat: "61.8059147",
    lon: "36.5330088",
  },
  {
    city: "Сегежа",
    lat: "63.7437211",
    lon: "34.3126755",
  },
  {
    city: "Сортавала",
    lat: "61.7032216",
    lon: "30.6917021",
  },
  {
    city: "Суоярви",
    lat: "62.0787769",
    lon: "32.3499029",
  },
  {
    city: "Анжеро-Судженск",
    lat: "56.0787179",
    lon: "86.0202207",
  },
  {
    city: "Белово",
    lat: "54.4221442",
    lon: "86.3036438",
  },
  {
    city: "Березовский",
    lat: "55.6692853",
    lon: "86.2744636",
  },
  {
    city: "Гурьевск",
    lat: "54.2860005",
    lon: "85.947723",
  },
  {
    city: "Калтан",
    lat: "53.5210461",
    lon: "87.2772143",
  },
  {
    city: "Кемерово",
    lat: "55.3909721",
    lon: "86.0467864",
  },
  {
    city: "Киселевск",
    lat: "54.0060382",
    lon: "86.6367387",
  },
  {
    city: "Ленинск-Кузнецкий",
    lat: "54.6674092",
    lon: "86.1796724",
  },
  {
    city: "Мариинск",
    lat: "56.2127836",
    lon: "87.7454392",
  },
  {
    city: "Междуреченск",
    lat: "53.6865695",
    lon: "88.0703888",
  },
  {
    city: "Мыски",
    lat: "53.7125516",
    lon: "87.8056657",
  },
  {
    city: "Новокузнецк",
    lat: "53.7942757",
    lon: "87.2144046",
  },
  {
    city: "Осинники",
    lat: "53.5987397",
    lon: "87.3369948",
  },
  {
    city: "Полысаево",
    lat: "54.6053968",
    lon: "86.2808803",
  },
  {
    city: "Прокопьевск",
    lat: "53.8604562",
    lon: "86.7183428",
  },
  {
    city: "Салаир",
    lat: "54.2351588",
    lon: "85.8029215",
  },
  {
    city: "Тайга",
    lat: "56.0622767",
    lon: "85.6207907",
  },
  {
    city: "Таштагол",
    lat: "52.7594505",
    lon: "87.8477272",
  },
  {
    city: "Топки",
    lat: "55.2766036",
    lon: "85.6153223",
  },
  {
    city: "Юрга",
    lat: "55.7202689",
    lon: "84.8885516",
  },
  {
    city: "Белая Холуница",
    lat: "58.8415212",
    lon: "50.8461002",
  },
  {
    city: "Вятские Поляны",
    lat: "56.2286058",
    lon: "51.0614666",
  },
  {
    city: "Зуевка",
    lat: "58.4031674",
    lon: "51.1330787",
  },
  {
    city: "Киров",
    lat: "58.6035313",
    lon: "49.6679219",
  },
  {
    city: "Кирово-Чепецк",
    lat: "58.5559921",
    lon: "50.0317608",
  },
  {
    city: "Кирс",
    lat: "59.3400586",
    lon: "52.2415895",
  },
  {
    city: "Котельнич",
    lat: "58.3035238",
    lon: "48.3474288",
  },
  {
    city: "Луза",
    lat: "60.6290781",
    lon: "47.2612069",
  },
  {
    city: "Малмыж",
    lat: "56.5243722",
    lon: "50.6782757",
  },
  {
    city: "Мураши",
    lat: "59.3956347",
    lon: "48.9637651",
  },
  {
    city: "Нолинск",
    lat: "57.5596946",
    lon: "49.9357867",
  },
  {
    city: "Омутнинск",
    lat: "58.6697684",
    lon: "52.1893554",
  },
  {
    city: "Орлов",
    lat: "58.5389402",
    lon: "48.8929268",
  },
  {
    city: "Слободской",
    lat: "58.7311934",
    lon: "50.1670091",
  },
  {
    city: "Советск",
    lat: "57.5841434",
    lon: "48.9589228",
  },
  {
    city: "Сосновка",
    lat: "56.2533149",
    lon: "51.2833412",
  },
  {
    city: "Уржум",
    lat: "57.1097612",
    lon: "50.0056278",
  },
  {
    city: "Яранск",
    lat: "57.304195",
    lon: "47.8479185",
  },
  {
    city: "Воркута",
    lat: "67.4973484",
    lon: "64.0611045",
  },
  {
    city: "Вуктыл",
    lat: "63.8615209",
    lon: "57.3165207",
  },
  {
    city: "Емва",
    lat: "62.5965314",
    lon: "50.8731889",
  },
  {
    city: "Инта",
    lat: "66.0368196",
    lon: "60.1154612",
  },
  {
    city: "Микунь",
    lat: "62.3580188",
    lon: "50.0719738",
  },
  {
    city: "Печора",
    lat: "65.1485717",
    lon: "57.22388",
  },
  {
    city: "Сосногорск",
    lat: "63.5990137",
    lon: "53.8762792",
  },
  {
    city: "Сыктывкар",
    lat: "61.668789",
    lon: "50.8356491",
  },
  {
    city: "Усинск",
    lat: "65.9941116",
    lon: "57.5570054",
  },
  {
    city: "Ухта",
    lat: "63.5564779",
    lon: "53.7014202",
  },
  {
    city: "Буй",
    lat: "58.473445",
    lon: "41.5306746",
  },
  {
    city: "Волгореченск",
    lat: "57.4423712",
    lon: "41.1593076",
  },
  {
    city: "Галич",
    lat: "58.3826861",
    lon: "42.3654563",
  },
  {
    city: "Кологрив",
    lat: "58.826988",
    lon: "44.3185323",
  },
  {
    city: "Кострома",
    lat: "57.8029445",
    lon: "40.9907282",
  },
  {
    city: "Макарьев",
    lat: "57.8808916",
    lon: "43.8014428",
  },
  {
    city: "Мантурово",
    lat: "58.3264667",
    lon: "44.7575036",
  },
  {
    city: "Нерехта",
    lat: "57.4543706",
    lon: "40.5725438",
  },
  {
    city: "Нея",
    lat: "58.2944499",
    lon: "43.8780965",
  },
  {
    city: "Солигалич",
    lat: "59.0786729",
    lon: "42.2877245",
  },
  {
    city: "Чухлома",
    lat: "58.7534246",
    lon: "42.6883783",
  },
  {
    city: "Шарья",
    lat: "58.3761832",
    lon: "45.4060762",
  },
  {
    city: "Абинск",
    lat: "44.8679931",
    lon: "38.1618437",
  },
  {
    city: "Анапа",
    lat: "44.8950777",
    lon: "37.3163142",
  },
  {
    city: "Апшеронск",
    lat: "44.4585239",
    lon: "39.7300092",
  },
  {
    city: "Армавир",
    lat: "45.0010338",
    lon: "41.132392",
  },
  {
    city: "Белореченск",
    lat: "44.7652733",
    lon: "39.8780457",
  },
  {
    city: "Геленджик",
    lat: "44.5631053",
    lon: "38.0790184",
  },
  {
    city: "Горячий Ключ",
    lat: "44.6343251",
    lon: "39.1356421",
  },
  {
    city: "Гулькевичи",
    lat: "45.3605769",
    lon: "40.6918484",
  },
  {
    city: "Ейск",
    lat: "46.7114611",
    lon: "38.2764915",
  },
  {
    city: "Кореновск",
    lat: "45.4640868",
    lon: "39.4590178",
  },
  {
    city: "Краснодар",
    lat: "45.040235",
    lon: "38.9760801",
  },
  {
    city: "Кропоткин",
    lat: "45.4332464",
    lon: "40.5727852",
  },
  {
    city: "Крымск",
    lat: "44.9344108",
    lon: "37.9855314",
  },
  {
    city: "Курганинск",
    lat: "44.8876442",
    lon: "40.5913858",
  },
  {
    city: "Лабинск",
    lat: "44.6353153",
    lon: "40.724385",
  },
  {
    city: "Новокубанск",
    lat: "45.1038782",
    lon: "41.0473679",
  },
  {
    city: "Новороссийск",
    lat: "44.7234264",
    lon: "37.7687218",
  },
  {
    city: "Приморско-Ахтарск",
    lat: "46.0515",
    lon: "38.1704654",
  },
  {
    city: "Славянск-на-Кубани",
    lat: "45.2605079",
    lon: "38.1260725",
  },
  {
    city: "Сочи",
    lat: "43.5855829",
    lon: "39.7231419",
  },
  {
    city: "Темрюк",
    lat: "45.2611082",
    lon: "37.445519",
  },
  {
    city: "Тимашевск",
    lat: "45.6159358",
    lon: "38.9350513",
  },
  {
    city: "Тихорецк",
    lat: "45.8546953",
    lon: "40.1258702",
  },
  {
    city: "Туапсе",
    lat: "44.1103707",
    lon: "39.082645",
  },
  {
    city: "Усть-Лабинск",
    lat: "45.222676",
    lon: "39.6930239",
  },
  {
    city: "Хадыженск",
    lat: "44.412303",
    lon: "39.5319151",
  },
  {
    city: "Артемовск",
    lat: "54.3472901",
    lon: "93.4356543",
  },
  {
    city: "Ачинск",
    lat: "56.2538662",
    lon: "90.47949",
  },
  {
    city: "Боготол",
    lat: "56.209881",
    lon: "89.5300182",
  },
  {
    city: "Бородино",
    lat: "55.9054308",
    lon: "94.9021138",
  },
  {
    city: "Дивногорск",
    lat: "55.9577868",
    lon: "92.380085",
  },
  {
    city: "Дудинка",
    lat: "69.4031339",
    lon: "86.1908135",
  },
  {
    city: "Енисейск",
    lat: "58.4485234",
    lon: "92.165237",
  },
  {
    city: "Железногорск",
    lat: "56.2529346",
    lon: "93.532167",
  },
  {
    city: "Заозерный",
    lat: "55.9617268",
    lon: "94.7091037",
  },
  {
    city: "Зеленогорск",
    lat: "56.1133001",
    lon: "94.5888736",
  },
  {
    city: "Игарка",
    lat: "67.4667947",
    lon: "86.5814287",
  },
  {
    city: "Иланский",
    lat: "56.2374163",
    lon: "96.0672656",
  },
  {
    city: "Канск",
    lat: "56.2049776",
    lon: "95.7051246",
  },
  {
    city: "Кодинск",
    lat: "58.6033961",
    lon: "99.1797563",
  },
  {
    city: "Красноярск",
    lat: "56.009466",
    lon: "92.8524162",
  },
  {
    city: "Лесосибирск",
    lat: "58.2218201",
    lon: "92.5036986",
  },
  {
    city: "Минусинск",
    lat: "53.7105509",
    lon: "91.6871866",
  },
  {
    city: "Назарово",
    lat: "56.0113176",
    lon: "90.4167947",
  },
  {
    city: "Норильск",
    lat: "69.3490828",
    lon: "88.2009965",
  },
  {
    city: "Сосновоборск",
    lat: "56.1202088",
    lon: "93.3353411",
  },
  {
    city: "Ужур",
    lat: "55.3141977",
    lon: "89.8333827",
  },
  {
    city: "Уяр",
    lat: "55.8131698",
    lon: "94.3282148",
  },
  {
    city: "Шарыпово",
    lat: "55.5389684",
    lon: "89.1801557",
  },
  {
    city: "Ялта",
    lat: "44.416366",
    lon: "34.04455",
  },
  {
    city: "Алушта",
    lat: "44.6764419",
    lon: "34.4100387",
  },
  {
    city: "Армянск",
    lat: "46.1059247",
    lon: "33.6910325",
  },
  {
    city: "Бахчисарай",
    lat: "44.751388",
    lon: "33.8750341",
  },
  {
    city: "Белогорск",
    lat: "45.0571581",
    lon: "34.5998775",
  },
  {
    city: "Джанкой",
    lat: "45.7092436",
    lon: "34.388332",
  },
  {
    city: "Евпатория",
    lat: "45.1904322",
    lon: "33.3667685",
  },
  {
    city: "Керчь",
    lat: "45.3561128",
    lon: "36.4674285",
  },
  {
    city: "Красноперекопск",
    lat: "45.9537956",
    lon: "33.7921523",
  },
  {
    city: "Саки",
    lat: "45.1342889",
    lon: "33.6032508",
  },
  {
    city: "Симферополь",
    lat: "44.9482645",
    lon: "34.100117",
  },
  {
    city: "Старый Крым",
    lat: "45.0290659",
    lon: "35.0900885",
  },
  {
    city: "Судак",
    lat: "44.8505913",
    lon: "34.9761591",
  },
  {
    city: "Феодосия",
    lat: "45.031878",
    lon: "35.3824772",
  },
  {
    city: "Щелкино",
    lat: "45.4289847",
    lon: "35.8251329",
  },
  {
    city: "Ялта",
    lat: "44.4951948",
    lon: "34.166386",
  },
  {
    city: "Далматово",
    lat: "56.2621393",
    lon: "62.9387378",
  },
  {
    city: "Катайск",
    lat: "56.2908118",
    lon: "62.5800669",
  },
  {
    city: "Курган",
    lat: "55.4443448",
    lon: "65.3161339",
  },
  {
    city: "Куртамыш",
    lat: "54.9368491",
    lon: "64.4203009",
  },
  {
    city: "Макушино",
    lat: "55.2154025",
    lon: "67.2452558",
  },
  {
    city: "Петухово",
    lat: "55.0649932",
    lon: "67.8874369",
  },
  {
    city: "Шадринск",
    lat: "56.0870152",
    lon: "63.6298234",
  },
  {
    city: "Шумиха",
    lat: "55.2281833",
    lon: "63.2902391",
  },
  {
    city: "Щучье",
    lat: "55.20883",
    lon: "62.7478475",
  },
  {
    city: "Дмитриев",
    lat: "52.1269291",
    lon: "35.0739504",
  },
  {
    city: "Железногорск",
    lat: "52.3378753",
    lon: "35.3516834",
  },
  {
    city: "Курск",
    lat: "51.7303391",
    lon: "36.1926448",
  },
  {
    city: "Курчатов",
    lat: "51.6605475",
    lon: "35.6571711",
  },
  {
    city: "Льгов",
    lat: "51.6596935",
    lon: "35.2611592",
  },
  {
    city: "Обоянь",
    lat: "51.212012",
    lon: "36.275425",
  },
  {
    city: "Рыльск",
    lat: "51.568165",
    lon: "34.6802178",
  },
  {
    city: "Суджа",
    lat: "51.1919711",
    lon: "35.2719619",
  },
  {
    city: "Фатеж",
    lat: "52.0918591",
    lon: "35.8538912",
  },
  {
    city: "Щигры",
    lat: "51.8787808",
    lon: "36.8910674",
  },
  {
    city: "Бокситогорск",
    lat: "59.4735032",
    lon: "33.8456521",
  },
  {
    city: "Волосово",
    lat: "59.4445107",
    lon: "29.492277",
  },
  {
    city: "Волхов",
    lat: "59.9006057",
    lon: "32.35212",
  },
  {
    city: "Всеволожск",
    lat: "60.0190094",
    lon: "30.6455834",
  },
  {
    city: "Выборг",
    lat: "60.7130748",
    lon: "28.7328813",
  },
  {
    city: "Высоцк",
    lat: "60.6296511",
    lon: "28.5709914",
  },
  {
    city: "Гатчина",
    lat: "59.5650861",
    lon: "30.1281859",
  },
  {
    city: "Ивангород",
    lat: "59.3765845",
    lon: "28.2230504",
  },
  {
    city: "Каменногорск",
    lat: "60.9508768",
    lon: "29.1308061",
  },
  {
    city: "Кингисепп",
    lat: "59.3739407",
    lon: "28.6112981",
  },
  {
    city: "Кириши",
    lat: "59.4742626",
    lon: "32.0625536",
  },
  {
    city: "Кировск",
    lat: "59.875371",
    lon: "30.9815205",
  },
  {
    city: "Коммунар",
    lat: "59.6215929",
    lon: "30.393466",
  },
  {
    city: "Лодейное Поле",
    lat: "60.7320564",
    lon: "33.5522225",
  },
  {
    city: "Луга",
    lat: "58.7373818",
    lon: "29.8466657",
  },
  {
    city: "Любань",
    lat: "59.3492573",
    lon: "31.2485276",
  },
  {
    city: "Никольское",
    lat: "59.7042633",
    lon: "30.7874879",
  },
  {
    city: "Новая Ладога",
    lat: "60.1100013",
    lon: "32.3141446",
  },
  {
    city: "Отрадное",
    lat: "59.772596",
    lon: "30.7988403",
  },
  {
    city: "Пикалево",
    lat: "59.5130655",
    lon: "34.1773982",
  },
  {
    city: "Подпорожье",
    lat: "60.9127463",
    lon: "34.1567832",
  },
  {
    city: "Приморск",
    lat: "60.3660787",
    lon: "28.6135962",
  },
  {
    city: "Приозерск",
    lat: "61.03313",
    lon: "30.15876",
  },
  {
    city: "Светогорск",
    lat: "61.1112679",
    lon: "28.8726666",
  },
  {
    city: "Сертолово",
    lat: "60.14458",
    lon: "30.2094595",
  },
  {
    city: "Сланцы",
    lat: "59.1178693",
    lon: "28.088106",
  },
  {
    city: "Сосновый Бор",
    lat: "59.8772921",
    lon: "29.1290866",
  },
  {
    city: "Сясьстрой",
    lat: "60.1402454",
    lon: "32.5602015",
  },
  {
    city: "Тихвин",
    lat: "59.6273809",
    lon: "33.5072307",
  },
  {
    city: "Тосно",
    lat: "59.5406697",
    lon: "30.8777872",
  },
  {
    city: "Шлиссельбург",
    lat: "59.9443923",
    lon: "31.0334136",
  },
  {
    city: "Грязи",
    lat: "52.4873931",
    lon: "39.9331785",
  },
  {
    city: "Данков",
    lat: "53.25769",
    lon: "39.1457625",
  },
  {
    city: "Елец",
    lat: "52.6151738",
    lon: "38.5289121",
  },
  {
    city: "Задонск",
    lat: "52.4004611",
    lon: "38.9205772",
  },
  {
    city: "Лебедянь",
    lat: "53.0156678",
    lon: "39.143498",
  },
  {
    city: "Липецк",
    lat: "52.6103027",
    lon: "39.5946266",
  },
  {
    city: "Усмань",
    lat: "52.0444165",
    lon: "39.7264516",
  },
  {
    city: "Чаплыгин",
    lat: "53.2404794",
    lon: "39.9671563",
  },
  {
    city: "Магадан",
    lat: "59.5681763",
    lon: "150.8085289",
  },
  {
    city: "Сусуман",
    lat: "62.7804628",
    lon: "148.154033",
  },
  {
    city: "Волжск",
    lat: "55.8622987",
    lon: "48.371553",
  },
  {
    city: "Звенигово",
    lat: "55.9739374",
    lon: "48.0170276",
  },
  {
    city: "Йошкар-Ола",
    lat: "56.6343763",
    lon: "47.8998445",
  },
  {
    city: "Козьмодемьянск",
    lat: "56.333346",
    lon: "46.5466282",
  },
  {
    city: "Ардатов",
    lat: "54.8465693",
    lon: "46.2412736",
  },
  {
    city: "Инсар",
    lat: "53.8770384",
    lon: "44.3696866",
  },
  {
    city: "Ковылкино",
    lat: "54.0391464",
    lon: "43.9191229",
  },
  {
    city: "Краснослободск",
    lat: "54.4248634",
    lon: "43.7845096",
  },
  {
    city: "Рузаевка",
    lat: "54.0583238",
    lon: "44.949116",
  },
  {
    city: "Саранск",
    lat: "54.1807601",
    lon: "45.1862263",
  },
  {
    city: "Темников",
    lat: "54.6309086",
    lon: "43.2161785",
  },
  {
    city: "Москва",
    lat: "55.7538789",
    lon: "37.6203735",
  },
  {
    city: "Апрелевка",
    lat: "55.5276336",
    lon: "37.0651105",
  },
  {
    city: "Балашиха",
    lat: "55.7963352",
    lon: "37.9381413",
  },
  {
    city: "Бронницы",
    lat: "55.4255534",
    lon: "38.2640794",
  },
  {
    city: "Верея",
    lat: "55.3674668",
    lon: "36.1563083",
  },
  {
    city: "Видное",
    lat: "55.5518323",
    lon: "37.7062062",
  },
  {
    city: "Волоколамск",
    lat: "56.0358121",
    lon: "35.9585027",
  },
  {
    city: "Воскресенск",
    lat: "55.3071305",
    lon: "38.7026949",
  },
  {
    city: "Высоковск",
    lat: "56.336141",
    lon: "36.5251316",
  },
  {
    city: "Голицыно",
    lat: "55.6189762",
    lon: "36.9855559",
  },
  {
    city: "Дедовск",
    lat: "55.8704718",
    lon: "37.1244724",
  },
  {
    city: "Дзержинский",
    lat: "55.6241079",
    lon: "37.8440691",
  },
  {
    city: "Дмитров",
    lat: "56.3477176",
    lon: "37.5267184",
  },
  {
    city: "Долгопрудный",
    lat: "55.9384901",
    lon: "37.5100527",
  },
  {
    city: "Домодедово",
    lat: "55.4363901",
    lon: "37.7666263",
  },
  {
    city: "Дрезна",
    lat: "55.7442991",
    lon: "38.8499228",
  },
  {
    city: "Дубна",
    lat: "56.7417949",
    lon: "37.1757163",
  },
  {
    city: "Егорьевск",
    lat: "55.3831326",
    lon: "39.0358236",
  },
  {
    city: "Жуковский",
    lat: "55.5998408",
    lon: "38.1224185",
  },
  {
    city: "Зарайск",
    lat: "54.7625993",
    lon: "38.8851485",
  },
  {
    city: "Звенигород",
    lat: "55.7296168",
    lon: "36.8552843",
  },
  {
    city: "Ивантеевка",
    lat: "55.9742303",
    lon: "37.9208755",
  },
  {
    city: "Истра",
    lat: "55.9061087",
    lon: "36.8600854",
  },
  {
    city: "Кашира",
    lat: "54.8534263",
    lon: "38.1903818",
  },
  {
    city: "Клин",
    lat: "56.3424886",
    lon: "36.7240912",
  },
  {
    city: "Коломна",
    lat: "55.1027797",
    lon: "38.7531734",
  },
  {
    city: "Королев",
    lat: "55.9162558",
    lon: "37.8545224",
  },
  {
    city: "Котельники",
    lat: "55.659898",
    lon: "37.8632865",
  },
  {
    city: "Красноармейск",
    lat: "51.0268595",
    lon: "45.7011086",
  },
  {
    city: "Красногорск",
    lat: "55.8318475",
    lon: "37.32942",
  },
  {
    city: "Краснозаводск",
    lat: "56.4408723",
    lon: "38.2320671",
  },
  {
    city: "Краснознаменск",
    lat: "55.5978962",
    lon: "37.0395137",
  },
  {
    city: "Кубинка",
    lat: "55.5755679",
    lon: "36.6952487",
  },
  {
    city: "Куровское",
    lat: "55.5791491",
    lon: "38.9208543",
  },
  {
    city: "Ликино-Дулево",
    lat: "55.7078531",
    lon: "38.9577103",
  },
  {
    city: "Лобня",
    lat: "56.0328745",
    lon: "37.4614671",
  },
  {
    city: "Лосино-Петровский",
    lat: "55.8714441",
    lon: "38.2005377",
  },
  {
    city: "Луховицы",
    lat: "54.9651617",
    lon: "39.0261346",
  },
  {
    city: "Лыткарино",
    lat: "55.5778065",
    lon: "37.9034952",
  },
  {
    city: "Люберцы",
    lat: "55.700416",
    lon: "37.9606496",
  },
  {
    city: "Можайск",
    lat: "55.5069819",
    lon: "36.0240724",
  },
  {
    city: "Мытищи",
    lat: "55.9104647",
    lon: "37.7363702",
  },
  {
    city: "Наро-Фоминск",
    lat: "55.3802749",
    lon: "36.7608038",
  },
  {
    city: "Ногинск",
    lat: "55.8686239",
    lon: "38.4621635",
  },
  {
    city: "Одинцово",
    lat: "55.6789292",
    lon: "37.2636389",
  },
  {
    city: "Озеры",
    lat: "54.8539944",
    lon: "38.55987",
  },
  {
    city: "Орехово-Зуево",
    lat: "55.8151729",
    lon: "38.9870711",
  },
  {
    city: "Павловский Посад",
    lat: "55.7806718",
    lon: "38.6596047",
  },
  {
    city: "Пересвет",
    lat: "56.4158828",
    lon: "38.1733567",
  },
  {
    city: "Подольск",
    lat: "55.4389588",
    lon: "37.57027",
  },
  {
    city: "Протвино",
    lat: "54.8706614",
    lon: "37.2183307",
  },
  {
    city: "Пушкино",
    lat: "56.0104548",
    lon: "37.8471438",
  },
  {
    city: "Пущино",
    lat: "54.832521",
    lon: "37.6210428",
  },
  {
    city: "Раменское",
    lat: "55.549529",
    lon: "38.273015",
  },
  {
    city: "Реутов",
    lat: "55.758236",
    lon: "37.8619443",
  },
  {
    city: "Рошаль",
    lat: "55.6632504",
    lon: "39.8655434",
  },
  {
    city: "Руза",
    lat: "55.7015302",
    lon: "36.1960043",
  },
  {
    city: "Сергиев Посад",
    lat: "56.3063411",
    lon: "38.1502568",
  },
  {
    city: "Серпухов",
    lat: "54.9225396",
    lon: "37.4032682",
  },
  {
    city: "Солнечногорск",
    lat: "56.2148655",
    lon: "37.0967653",
  },
  {
    city: "Старая Купавна",
    lat: "55.8038411",
    lon: "38.1426144",
  },
  {
    city: "Ступино",
    lat: "54.9238403",
    lon: "38.1186976",
  },
  {
    city: "Талдом",
    lat: "56.7308993",
    lon: "37.5276414",
  },
  {
    city: "Фрязино",
    lat: "55.9590154",
    lon: "38.0409171",
  },
  {
    city: "Химки",
    lat: "55.8886705",
    lon: "37.4304154",
  },
  {
    city: "Хотьково",
    lat: "56.2515725",
    lon: "37.9395225",
  },
  {
    city: "Черноголовка",
    lat: "56.0100909",
    lon: "38.3792328",
  },
  {
    city: "Чехов",
    lat: "55.1507175",
    lon: "37.4532591",
  },
  {
    city: "Шатура",
    lat: "55.5777942",
    lon: "39.5443781",
  },
  {
    city: "Щелково",
    lat: "55.9234303",
    lon: "37.9784419",
  },
  {
    city: "Электрогорск",
    lat: "55.8778573",
    lon: "38.7805239",
  },
  {
    city: "Электросталь",
    lat: "55.7847718",
    lon: "38.4446531",
  },
  {
    city: "Электроугли",
    lat: "55.7170329",
    lon: "38.2194049",
  },
  {
    city: "Яхрома",
    lat: "56.2889858",
    lon: "37.4831016",
  },
  {
    city: "Апатиты",
    lat: "67.5678295",
    lon: "33.4067218",
  },
  {
    city: "Гаджиево",
    lat: "69.2490009",
    lon: "33.3152445",
  },
  {
    city: "Заозерск",
    lat: "69.4003895",
    lon: "32.4502225",
  },
  {
    city: "Заполярный",
    lat: "69.413232",
    lon: "30.7985332",
  },
  {
    city: "Кандалакша",
    lat: "67.1567298",
    lon: "32.4142303",
  },
  {
    city: "Кировск",
    lat: "67.6150979",
    lon: "33.6637196",
  },
  {
    city: "Ковдор",
    lat: "67.5661466",
    lon: "30.4742082",
  },
  {
    city: "Кола",
    lat: "68.8785079",
    lon: "33.0262014",
  },
  {
    city: "Мончегорск",
    lat: "67.9385206",
    lon: "32.9358886",
  },
  {
    city: "Мурманск",
    lat: "69.0076958",
    lon: "33.0686019",
  },
  {
    city: "Оленегорск",
    lat: "68.1422068",
    lon: "33.2670094",
  },
  {
    city: "Островной",
    lat: "68.0509133",
    lon: "39.5076034",
  },
  {
    city: "Полярные Зори",
    lat: "67.3730192",
    lon: "32.497541",
  },
  {
    city: "Полярный",
    lat: "69.1988373",
    lon: "33.4509985",
  },
  {
    city: "Североморск",
    lat: "69.0765029",
    lon: "33.4178354",
  },
  {
    city: "Снежногорск",
    lat: "69.1921469",
    lon: "33.2382821",
  },
  {
    city: "Нарьян-Мар",
    lat: "67.6381525",
    lon: "53.0069336",
  },
  {
    city: "Арзамас",
    lat: "55.3947544",
    lon: "43.8407855",
  },
  {
    city: "Балахна",
    lat: "56.4949932",
    lon: "43.5758953",
  },
  {
    city: "Богородск",
    lat: "56.1019905",
    lon: "43.513678",
  },
  {
    city: "Бор",
    lat: "56.3565179",
    lon: "44.0644851",
  },
  {
    city: "Ветлуга",
    lat: "57.8558395",
    lon: "45.7762692",
  },
  {
    city: "Володарск",
    lat: "56.2168974",
    lon: "43.1597623",
  },
  {
    city: "Ворсма",
    lat: "55.9900425",
    lon: "43.2719879",
  },
  {
    city: "Выкса",
    lat: "55.3207103",
    lon: "42.1679169",
  },
  {
    city: "Горбатов",
    lat: "56.1307901",
    lon: "43.0626829",
  },
  {
    city: "Городец",
    lat: "56.6447459",
    lon: "43.4722975",
  },
  {
    city: "Дзержинск",
    lat: "56.2376438",
    lon: "43.4599363",
  },
  {
    city: "Заволжье",
    lat: "56.6404237",
    lon: "43.3871565",
  },
  {
    city: "Княгинино",
    lat: "55.8205157",
    lon: "45.0322947",
  },
  {
    city: "Кстово",
    lat: "56.1433353",
    lon: "44.1665081",
  },
  {
    city: "Кулебаки",
    lat: "55.429716",
    lon: "42.512483",
  },
  {
    city: "Лукоянов",
    lat: "55.0327349",
    lon: "44.4933829",
  },
  {
    city: "Лысково",
    lat: "56.0262298",
    lon: "45.0356702",
  },
  {
    city: "Навашино",
    lat: "55.5439105",
    lon: "42.1887734",
  },
  {
    city: "Нижний Новгород",
    lat: "56.3242093",
    lon: "44.0053948",
  },
  {
    city: "Павлово",
    lat: "55.9797995",
    lon: "43.0996232",
  },
  {
    city: "Первомайск",
    lat: "54.8676182",
    lon: "43.8012829",
  },
  {
    city: "Перевоз",
    lat: "55.596904",
    lon: "44.5450268",
  },
  {
    city: "Саров",
    lat: "54.9227002",
    lon: "43.3447792",
  },
  {
    city: "Семенов",
    lat: "56.788935",
    lon: "44.4903571",
  },
  {
    city: "Сергач",
    lat: "55.5200364",
    lon: "45.4813193",
  },
  {
    city: "Урень",
    lat: "57.4612547",
    lon: "45.783394",
  },
  {
    city: "Чкаловск",
    lat: "56.7651549",
    lon: "43.2420193",
  },
  {
    city: "Шахунья",
    lat: "57.6764773",
    lon: "46.6129673",
  },
  {
    city: "Боровичи",
    lat: "58.3839866",
    lon: "33.9176761",
  },
  {
    city: "Валдай",
    lat: "57.9822906",
    lon: "33.2369492",
  },
  {
    city: "Великий Новгород",
    lat: "58.5214003",
    lon: "31.2755051",
  },
  {
    city: "Малая Вишера",
    lat: "58.8458076",
    lon: "32.2247984",
  },
  {
    city: "Окуловка",
    lat: "58.3908717",
    lon: "33.2902474",
  },
  {
    city: "Пестово",
    lat: "58.5973944",
    lon: "35.8144523",
  },
  {
    city: "Сольцы",
    lat: "58.1201693",
    lon: "30.309285",
  },
  {
    city: "Старая Русса",
    lat: "57.9906873",
    lon: "31.3555076",
  },
  {
    city: "Холм",
    lat: "57.1451036",
    lon: "31.1787812",
  },
  {
    city: "Чудово",
    lat: "59.1247477",
    lon: "31.6865406",
  },
  {
    city: "Барабинск",
    lat: "55.3515917",
    lon: "78.3465012",
  },
  {
    city: "Бердск",
    lat: "54.7582375",
    lon: "83.1072212",
  },
  {
    city: "Болотное",
    lat: "55.6693773",
    lon: "84.3906599",
  },
  {
    city: "Искитим",
    lat: "54.6266869",
    lon: "83.2951444",
  },
  {
    city: "Карасук",
    lat: "53.7343772",
    lon: "78.042457",
  },
  {
    city: "Каргат",
    lat: "55.1943829",
    lon: "80.2831324",
  },
  {
    city: "Куйбышев",
    lat: "55.4684104",
    lon: "78.3241042",
  },
  {
    city: "Купино",
    lat: "54.3660317",
    lon: "77.2972969",
  },
  {
    city: "Новосибирск",
    lat: "55.0281016",
    lon: "82.9210575",
  },
  {
    city: "Обь",
    lat: "54.9945882",
    lon: "82.6937925",
  },
  {
    city: "Татарск",
    lat: "55.2145894",
    lon: "75.9740805",
  },
  {
    city: "Тогучин",
    lat: "55.2250038",
    lon: "84.4103867",
  },
  {
    city: "Черепаново",
    lat: "54.2206974",
    lon: "83.3724392",
  },
  {
    city: "Чулым",
    lat: "55.0906205",
    lon: "80.9592152",
  },
  {
    city: "Исилькуль",
    lat: "54.9096156",
    lon: "71.2816107",
  },
  {
    city: "Калачинск",
    lat: "55.0598547",
    lon: "74.5655075",
  },
  {
    city: "Называевск",
    lat: "55.5688811",
    lon: "71.3502572",
  },
  {
    city: "Омск",
    lat: "54.9848136",
    lon: "73.3674638",
  },
  {
    city: "Тара",
    lat: "56.9159171",
    lon: "74.3649643",
  },
  {
    city: "Тюкалинск",
    lat: "55.8705121",
    lon: "72.1956156",
  },
  {
    city: "Абдулино",
    lat: "53.6778096",
    lon: "53.6473115",
  },
  {
    city: "Бугуруслан",
    lat: "53.6522636",
    lon: "52.4326166",
  },
  {
    city: "Бузулук",
    lat: "52.7881434",
    lon: "52.2623757",
  },
  {
    city: "Гай",
    lat: "51.4649138",
    lon: "58.4436189",
  },
  {
    city: "Кувандык",
    lat: "51.4784845",
    lon: "57.3612029",
  },
  {
    city: "Медногорск",
    lat: "51.4039421",
    lon: "57.5832185",
  },
  {
    city: "Новотроицк",
    lat: "51.1965071",
    lon: "58.3017455",
  },
  {
    city: "Оренбург",
    lat: "51.7875191",
    lon: "55.1017379",
  },
  {
    city: "Орск",
    lat: "51.2293069",
    lon: "58.4751889",
  },
  {
    city: "Соль-Илецк",
    lat: "51.1634976",
    lon: "54.9895391",
  },
  {
    city: "Сорочинск",
    lat: "52.4265081",
    lon: "53.1542123",
  },
  {
    city: "Ясный",
    lat: "51.0369499",
    lon: "59.8743256",
  },
  {
    city: "Болхов",
    lat: "53.4440204",
    lon: "36.0076969",
  },
  {
    city: "Дмитровск",
    lat: "52.5053481",
    lon: "35.141535",
  },
  {
    city: "Ливны",
    lat: "52.4285122",
    lon: "37.603944",
  },
  {
    city: "Малоархангельск",
    lat: "52.4001151",
    lon: "36.5037931",
  },
  {
    city: "Мценск",
    lat: "53.2790021",
    lon: "36.574992",
  },
  {
    city: "Новосиль",
    lat: "52.9747225",
    lon: "37.0438402",
  },
  {
    city: "Орёл",
    lat: "52.9672573",
    lon: "36.0696479",
  },
  {
    city: "Белинский",
    lat: "52.9641169",
    lon: "43.4185003",
  },
  {
    city: "Городище",
    lat: "53.2727888",
    lon: "45.702731",
  },
  {
    city: "Заречный",
    lat: "53.1961009",
    lon: "45.1691502",
  },
  {
    city: "Каменка",
    lat: "53.1855474",
    lon: "44.0468501",
  },
  {
    city: "Кузнецк",
    lat: "53.1131686",
    lon: "46.6052497",
  },
  {
    city: "Нижний Ломов",
    lat: "53.5301274",
    lon: "43.6729216",
  },
  {
    city: "Никольск",
    lat: "53.7138397",
    lon: "46.079962",
  },
  {
    city: "Пенза",
    lat: "53.1753884",
    lon: "45.0347408",
  },
  {
    city: "Сердобск",
    lat: "52.4697532",
    lon: "44.2122688",
  },
  {
    city: "Спасск",
    lat: "53.927163",
    lon: "43.1860475",
  },
  {
    city: "Сурск",
    lat: "53.0760597",
    lon: "45.6911897",
  },
  {
    city: "Александровск",
    lat: "59.1613773",
    lon: "57.5764851",
  },
  {
    city: "Березники",
    lat: "59.4079898",
    lon: "56.8040725",
  },
  {
    city: "Верещагино",
    lat: "58.0797908",
    lon: "54.6580948",
  },
  {
    city: "Горнозаводск",
    lat: "58.3743406",
    lon: "58.3230329",
  },
  {
    city: "Гремячинск",
    lat: "58.5625603",
    lon: "57.8520073",
  },
  {
    city: "Губаха",
    lat: "58.837024",
    lon: "57.5544441",
  },
  {
    city: "Добрянка",
    lat: "58.4696353",
    lon: "56.4131294",
  },
  {
    city: "Кизел",
    lat: "59.0511764",
    lon: "57.6471214",
  },
  {
    city: "Красновишерск",
    lat: "60.3902242",
    lon: "57.0537244",
  },
  {
    city: "Краснокамск",
    lat: "58.0820946",
    lon: "55.7479797",
  },
  {
    city: "Кудымкар",
    lat: "59.0168605",
    lon: "54.6573459",
  },
  {
    city: "Кунгур",
    lat: "57.4283217",
    lon: "56.9437787",
  },
  {
    city: "Лысьва",
    lat: "58.0995987",
    lon: "57.8085728",
  },
  {
    city: "Нытва",
    lat: "57.9337429",
    lon: "55.3357261",
  },
  {
    city: "Оса",
    lat: "57.2889992",
    lon: "55.4688982",
  },
  {
    city: "Оханск",
    lat: "57.7178946",
    lon: "55.387153",
  },
  {
    city: "Очер",
    lat: "57.8851991",
    lon: "54.7161756",
  },
  {
    city: "Пермь",
    lat: "58.0103211",
    lon: "56.2341778",
  },
  {
    city: "Соликамск",
    lat: "59.6483518",
    lon: "56.7710358",
  },
  {
    city: "Усолье",
    lat: "59.4279356",
    lon: "56.6837783",
  },
  {
    city: "Чайковский",
    lat: "56.7780203",
    lon: "54.1478482",
  },
  {
    city: "Чердынь",
    lat: "60.4011184",
    lon: "56.4801391",
  },
  {
    city: "Чермоз",
    lat: "58.7842527",
    lon: "56.1507562",
  },
  {
    city: "Чернушка",
    lat: "56.5161079",
    lon: "56.0763919",
  },
  {
    city: "Чусовой",
    lat: "58.2974725",
    lon: "57.8193122",
  },
  {
    city: "Арсеньев",
    lat: "44.16208",
    lon: "133.269622",
  },
  {
    city: "Артем",
    lat: "43.350053",
    lon: "132.1596594",
  },
  {
    city: "Большой Камень",
    lat: "43.1112737",
    lon: "132.3480354",
  },
  {
    city: "Владивосток",
    lat: "43.1163807",
    lon: "131.882348",
  },
  {
    city: "Дальнегорск",
    lat: "44.5539909",
    lon: "135.5662536",
  },
  {
    city: "Дальнереченск",
    lat: "45.9307882",
    lon: "133.7316542",
  },
  {
    city: "Лесозаводск",
    lat: "45.4780192",
    lon: "133.4185501",
  },
  {
    city: "Находка",
    lat: "42.8240404",
    lon: "132.8927812",
  },
  {
    city: "Партизанск",
    lat: "43.1279833",
    lon: "133.1264754",
  },
  {
    city: "Спасск-Дальний",
    lat: "44.5900929",
    lon: "132.8157564",
  },
  {
    city: "Уссурийск",
    lat: "43.79726",
    lon: "131.9517262",
  },
  {
    city: "Фокино",
    lat: "42.9707163",
    lon: "132.4110209",
  },
  {
    city: "Великие Луки",
    lat: "56.3321847",
    lon: "30.550757",
  },
  {
    city: "Гдов",
    lat: "58.7432585",
    lon: "27.8263328",
  },
  {
    city: "Дно",
    lat: "57.8269802",
    lon: "29.9629569",
  },
  {
    city: "Невель",
    lat: "56.0201544",
    lon: "29.9240505",
  },
  {
    city: "Новоржев",
    lat: "57.0298332",
    lon: "29.343333",
  },
  {
    city: "Новосокольники",
    lat: "56.3407627",
    lon: "30.1527712",
  },
  {
    city: "Опочка",
    lat: "56.7107956",
    lon: "28.6717455",
  },
  {
    city: "Остров",
    lat: "57.3452408",
    lon: "28.3437107",
  },
  {
    city: "Печоры",
    lat: "57.8146689",
    lon: "27.6222823",
  },
  {
    city: "Порхов",
    lat: "57.7764223",
    lon: "29.5436424",
  },
  {
    city: "Псков",
    lat: "57.819284",
    lon: "28.3318188",
  },
  {
    city: "Пустошка",
    lat: "56.3375131",
    lon: "29.3668243",
  },
  {
    city: "Пыталово",
    lat: "57.0637109",
    lon: "27.9234759",
  },
  {
    city: "Себеж",
    lat: "56.2907663",
    lon: "28.4725735",
  },
  {
    city: "Азов",
    lat: "47.1120631",
    lon: "39.4232597",
  },
  {
    city: "Аксай",
    lat: "47.2676075",
    lon: "39.8755485",
  },
  {
    city: "Батайск",
    lat: "47.138321",
    lon: "39.7508382",
  },
  {
    city: "Белая Калитва",
    lat: "48.176948",
    lon: "40.8033169",
  },
  {
    city: "Волгодонск",
    lat: "47.5165181",
    lon: "42.1984531",
  },
  {
    city: "Гуково",
    lat: "48.0449422",
    lon: "39.9484635",
  },
  {
    city: "Донецк",
    lat: "48.3350928",
    lon: "39.9460654",
  },
  {
    city: "Зверево",
    lat: "48.043451",
    lon: "40.1264948",
  },
  {
    city: "Зерноград",
    lat: "46.8494991",
    lon: "40.312765",
  },
  {
    city: "Каменск-Шахтинский",
    lat: "48.3204412",
    lon: "40.268874",
  },
  {
    city: "Константиновск",
    lat: "47.5773456",
    lon: "41.0967362",
  },
  {
    city: "Красный Сулин",
    lat: "47.8830826",
    lon: "40.0781385",
  },
  {
    city: "Миллерово",
    lat: "48.925821",
    lon: "40.3983302",
  },
  {
    city: "Морозовск",
    lat: "48.3511724",
    lon: "41.8308006",
  },
  {
    city: "Новочеркасск",
    lat: "47.4119248",
    lon: "40.1042066",
  },
  {
    city: "Новошахтинск",
    lat: "47.7576522",
    lon: "39.9364709",
  },
  {
    city: "Пролетарск",
    lat: "46.7038968",
    lon: "41.7274533",
  },
  {
    city: "Ростов-на-Дону",
    lat: "47.2224364",
    lon: "39.7187866",
  },
  {
    city: "Сальск",
    lat: "46.4751689",
    lon: "41.5412229",
  },
  {
    city: "Семикаракорск",
    lat: "47.5177981",
    lon: "40.811585",
  },
  {
    city: "Таганрог",
    lat: "47.2094907",
    lon: "38.935154",
  },
  {
    city: "Цимлянск",
    lat: "47.6477668",
    lon: "42.093022",
  },
  {
    city: "Шахты",
    lat: "47.7084247",
    lon: "40.2159154",
  },
  {
    city: "Касимов",
    lat: "54.9373788",
    lon: "41.3912912",
  },
  {
    city: "Кораблино",
    lat: "53.9245422",
    lon: "40.0227867",
  },
  {
    city: "Михайлов",
    lat: "54.2296493",
    lon: "39.0090857",
  },
  {
    city: "Новомичуринск",
    lat: "54.0377979",
    lon: "39.7467023",
  },
  {
    city: "Рыбное",
    lat: "54.7255937",
    lon: "39.513438",
  },
  {
    city: "Ряжск",
    lat: "53.7067718",
    lon: "40.0521358",
  },
  {
    city: "Рязань",
    lat: "54.625457",
    lon: "39.7359992",
  },
  {
    city: "Сасово",
    lat: "54.350807",
    lon: "41.9117458",
  },
  {
    city: "Скопин",
    lat: "53.8236028",
    lon: "39.5493286",
  },
  {
    city: "Спас-Клепики",
    lat: "55.1291472",
    lon: "40.1745036",
  },
  {
    city: "Спасск-Рязанский",
    lat: "54.4071497",
    lon: "40.3764367",
  },
  {
    city: "Шацк",
    lat: "54.0288845",
    lon: "41.7182108",
  },
  {
    city: "Жигулевск",
    lat: "53.4011545",
    lon: "49.494529",
  },
  {
    city: "Кинель",
    lat: "53.2209985",
    lon: "50.6343039",
  },
  {
    city: "Нефтегорск",
    lat: "52.797259",
    lon: "51.1637126",
  },
  {
    city: "Новокуйбышевск",
    lat: "53.0995303",
    lon: "49.9477662",
  },
  {
    city: "Октябрьск",
    lat: "53.1640886",
    lon: "48.6707463",
  },
  {
    city: "Отрадный",
    lat: "53.3800609",
    lon: "51.3438695",
  },
  {
    city: "Похвистнево",
    lat: "53.6498197",
    lon: "52.1235517",
  },
  {
    city: "Самара",
    lat: "53.1951657",
    lon: "50.1067691",
  },
  {
    city: "Сызрань",
    lat: "53.1557213",
    lon: "48.4745419",
  },
  {
    city: "Тольятти",
    lat: "53.5206438",
    lon: "49.389461",
  },
  {
    city: "Чапаевск",
    lat: "52.9289662",
    lon: "49.8674222",
  },
  {
    city: "Санкт-Петербург",
    lat: "59.939125",
    lon: "30.3158225",
  },
  {
    city: "Аркадак",
    lat: "51.9387813",
    lon: "43.4997558",
  },
  {
    city: "Аткарск",
    lat: "51.8736331",
    lon: "45.0003199",
  },
  {
    city: "Балаково",
    lat: "52.0222694",
    lon: "47.7828146",
  },
  {
    city: "Балашов",
    lat: "51.5389502",
    lon: "43.1839828",
  },
  {
    city: "Вольск",
    lat: "52.0459932",
    lon: "47.3873504",
  },
  {
    city: "Ершов",
    lat: "51.3508407",
    lon: "48.2763313",
  },
  {
    city: "Калининск",
    lat: "51.4992917",
    lon: "44.4710177",
  },
  {
    city: "Красноармейск",
    lat: "51.0236026",
    lon: "45.695141",
  },
  {
    city: "Красный Кут",
    lat: "50.9596867",
    lon: "46.9712472",
  },
  {
    city: "Маркс",
    lat: "51.7133973",
    lon: "46.7400684",
  },
  {
    city: "Новоузенск",
    lat: "50.4551744",
    lon: "48.1412622",
  },
  {
    city: "Петровск",
    lat: "52.3093782",
    lon: "45.3851649",
  },
  {
    city: "Пугачев",
    lat: "52.0158464",
    lon: "48.7972652",
  },
  {
    city: "Ртищево",
    lat: "52.2616298",
    lon: "43.7842399",
  },
  {
    city: "Саратов",
    lat: "51.530376",
    lon: "45.9530257",
  },
  {
    city: "Хвалынск",
    lat: "52.4950057",
    lon: "48.1045147",
  },
  {
    city: "Шиханы",
    lat: "52.1148241",
    lon: "47.2022928",
  },
  {
    city: "Энгельс",
    lat: "51.4854893",
    lon: "46.1267479",
  },
  {
    city: "Александровск-Сахалинский",
    lat: "50.8973664",
    lon: "142.1579322",
  },
  {
    city: "Анива",
    lat: "46.7132526",
    lon: "142.5265052",
  },
  {
    city: "Долинск",
    lat: "47.3255903",
    lon: "142.7945985",
  },
  {
    city: "Корсаков",
    lat: "46.6323995",
    lon: "142.7994094",
  },
  {
    city: "Курильск",
    lat: "45.2271915",
    lon: "147.8796713",
  },
  {
    city: "Макаров",
    lat: "48.6236287",
    lon: "142.7803508",
  },
  {
    city: "Невельск",
    lat: "46.6527314",
    lon: "141.8631741",
  },
  {
    city: "Оха",
    lat: "53.5868238",
    lon: "142.941221",
  },
  {
    city: "Поронайск",
    lat: "49.2387983",
    lon: "143.1007104",
  },
  {
    city: "Северо-Курильск",
    lat: "50.6731056",
    lon: "156.1280722",
  },
  {
    city: "Томари",
    lat: "47.7619957",
    lon: "142.061508",
  },
  {
    city: "Углегорск",
    lat: "49.0816311",
    lon: "142.0693033",
  },
  {
    city: "Холмск",
    lat: "47.0408637",
    lon: "142.0416619",
  },
  {
    city: "Южно-Сахалинск",
    lat: "46.959133",
    lon: "142.7381252",
  },
  {
    city: "Алапаевск",
    lat: "57.8475542",
    lon: "61.6693934",
  },
  {
    city: "Арамиль",
    lat: "56.6945341",
    lon: "60.8343825",
  },
  {
    city: "Артемовский",
    lat: "57.3384162",
    lon: "61.8946599",
  },
  {
    city: "Асбест",
    lat: "57.0052428",
    lon: "61.4581071",
  },
  {
    city: "Березовский",
    lat: "56.9096284",
    lon: "60.8180256",
  },
  {
    city: "Богданович",
    lat: "56.7764419",
    lon: "62.0463692",
  },
  {
    city: "Верхний Тагил",
    lat: "57.3762768",
    lon: "59.9516521",
  },
  {
    city: "Верхняя Пышма",
    lat: "56.9757833",
    lon: "60.564885",
  },
  {
    city: "Верхняя Салда",
    lat: "58.0466039",
    lon: "60.5560397",
  },
  {
    city: "Верхняя Тура",
    lat: "58.3643839",
    lon: "59.8266854",
  },
  {
    city: "Верхотурье",
    lat: "58.8621145",
    lon: "60.8104543",
  },
  {
    city: "Волчанск",
    lat: "59.9350515",
    lon: "60.0797964",
  },
  {
    city: "Дегтярск",
    lat: "56.7048199",
    lon: "60.0792227",
  },
  {
    city: "Екатеринбург",
    lat: "56.8386326",
    lon: "60.6054887",
  },
  {
    city: "Заречный",
    lat: "56.8103345",
    lon: "61.3380592",
  },
  {
    city: "Ивдель",
    lat: "60.6944353",
    lon: "60.4244661",
  },
  {
    city: "Ирбит",
    lat: "57.6838406",
    lon: "63.0576639",
  },
  {
    city: "Каменск-Уральский",
    lat: "56.4149095",
    lon: "61.9189837",
  },
  {
    city: "Камышлов",
    lat: "56.8465469",
    lon: "62.7120432",
  },
  {
    city: "Карпинск",
    lat: "59.7664444",
    lon: "60.0011798",
  },
  {
    city: "Качканар",
    lat: "58.7051759",
    lon: "59.4840198",
  },
  {
    city: "Кировград",
    lat: "57.4298451",
    lon: "60.0623588",
  },
  {
    city: "Краснотурьинск",
    lat: "59.7636934",
    lon: "60.1934451",
  },
  {
    city: "Красноуральск",
    lat: "58.3486334",
    lon: "60.0409011",
  },
  {
    city: "Красноуфимск",
    lat: "56.6122864",
    lon: "57.7636958",
  },
  {
    city: "Кушва",
    lat: "58.2825406",
    lon: "59.7646113",
  },
  {
    city: "Лесной",
    lat: "58.634981",
    lon: "59.7980528",
  },
  {
    city: "Михайловск",
    lat: "56.4369736",
    lon: "59.113865",
  },
  {
    city: "Невьянск",
    lat: "57.491233",
    lon: "60.2181839",
  },
  {
    city: "Нижние Серги",
    lat: "56.6544606",
    lon: "59.2952291",
  },
  {
    city: "Нижний Тагил",
    lat: "57.9101038",
    lon: "59.9813242",
  },
  {
    city: "Нижняя Салда",
    lat: "58.0749243",
    lon: "60.7026555",
  },
  {
    city: "Нижняя Тура",
    lat: "58.6310942",
    lon: "59.8521265",
  },
  {
    city: "Новая Ляля",
    lat: "59.053961",
    lon: "60.5945405",
  },
  {
    city: "Новоуральск",
    lat: "57.2471507",
    lon: "60.095701",
  },
  {
    city: "Первоуральск",
    lat: "56.9081665",
    lon: "59.9429205",
  },
  {
    city: "Полевской",
    lat: "56.4958085",
    lon: "60.2366314",
  },
  {
    city: "Ревда",
    lat: "56.79869",
    lon: "59.9071464",
  },
  {
    city: "Реж",
    lat: "57.3717914",
    lon: "61.3833223",
  },
  {
    city: "Североуральск",
    lat: "60.1533333",
    lon: "59.9525274",
  },
  {
    city: "Серов",
    lat: "59.6048651",
    lon: "60.5752136",
  },
  {
    city: "Среднеуральск",
    lat: "56.991883",
    lon: "60.4771953",
  },
  {
    city: "Сухой Лог",
    lat: "56.9075938",
    lon: "62.0358708",
  },
  {
    city: "Сысерть",
    lat: "56.50052",
    lon: "60.8190708",
  },
  {
    city: "Тавда",
    lat: "58.0434196",
    lon: "65.2743232",
  },
  {
    city: "Талица",
    lat: "57.0123359",
    lon: "63.7322467",
  },
  {
    city: "Туринск",
    lat: "58.0394258",
    lon: "63.698142",
  },
  {
    city: "Инкерман",
    lat: "44.6135153",
    lon: "33.6100739",
  },
  {
    city: "Севастополь",
    lat: "44.6167334",
    lon: "33.5253552",
  },
  {
    city: "Алагир",
    lat: "43.0416151",
    lon: "44.2198622",
  },
  {
    city: "Ардон",
    lat: "43.1756719",
    lon: "44.2955701",
  },
  {
    city: "Беслан",
    lat: "43.1937634",
    lon: "44.5338746",
  },
  {
    city: "Владикавказ",
    lat: "43.0205039",
    lon: "44.6819383",
  },
  {
    city: "Дигора",
    lat: "43.1567386",
    lon: "44.1551132",
  },
  {
    city: "Моздок",
    lat: "43.7471209",
    lon: "44.6571456",
  },
  {
    city: "Велиж",
    lat: "55.6058845",
    lon: "31.1857376",
  },
  {
    city: "Вязьма",
    lat: "55.2115563",
    lon: "34.2951196",
  },
  {
    city: "Гагарин",
    lat: "55.5526532",
    lon: "34.9949049",
  },
  {
    city: "Демидов",
    lat: "55.2682611",
    lon: "31.5062078",
  },
  {
    city: "Десногорск",
    lat: "54.1465117",
    lon: "33.2834063",
  },
  {
    city: "Дорогобуж",
    lat: "54.9137794",
    lon: "33.3024596",
  },
  {
    city: "Духовщина",
    lat: "55.1950509",
    lon: "32.4012351",
  },
  {
    city: "Ельня",
    lat: "54.5836832",
    lon: "33.1749566",
  },
  {
    city: "Починок",
    lat: "54.4063031",
    lon: "32.4397914",
  },
  {
    city: "Рославль",
    lat: "53.9449601",
    lon: "32.8479617",
  },
  {
    city: "Рудня",
    lat: "54.9441357",
    lon: "31.0794758",
  },
  {
    city: "Сафоново",
    lat: "55.1199868",
    lon: "33.233799",
  },
  {
    city: "Смоленск",
    lat: "54.7867168",
    lon: "31.8153366",
  },
  {
    city: "Сычевка",
    lat: "55.8307397",
    lon: "34.277868",
  },
  {
    city: "Ярцево",
    lat: "55.0564933",
    lon: "32.6902457",
  },
  {
    city: "Благодарный",
    lat: "45.0990834",
    lon: "43.4307042",
  },
  {
    city: "Буденновск",
    lat: "44.7814437",
    lon: "44.1650859",
  },
  {
    city: "Георгиевск",
    lat: "44.1486421",
    lon: "43.4739718",
  },
  {
    city: "Ессентуки",
    lat: "44.044461",
    lon: "42.8589078",
  },
  {
    city: "Железноводск",
    lat: "44.1320689",
    lon: "43.0306475",
  },
  {
    city: "Зеленокумск",
    lat: "44.403359",
    lon: "43.8841326",
  },
  {
    city: "Изобильный",
    lat: "45.3684342",
    lon: "41.7086448",
  },
  {
    city: "Ипатово",
    lat: "45.7181897",
    lon: "42.8969695",
  },
  {
    city: "Кисловодск",
    lat: "43.905235",
    lon: "42.7167187",
  },
  {
    city: "Лермонтов",
    lat: "44.1052526",
    lon: "42.9731433",
  },
  {
    city: "Минеральные Воды",
    lat: "44.2088942",
    lon: "43.1383482",
  },
  {
    city: "Михайловск",
    lat: "45.1296297",
    lon: "42.028787",
  },
  {
    city: "Невинномысск",
    lat: "44.6227404",
    lon: "41.9476147",
  },
  {
    city: "Нефтекумск",
    lat: "44.7544866",
    lon: "44.9865041",
  },
  {
    city: "Новоалександровск",
    lat: "45.4933561",
    lon: "41.2154482",
  },
  {
    city: "Новопавловск",
    lat: "43.9617565",
    lon: "43.6342855",
  },
  {
    city: "Пятигорск",
    lat: "44.0411669",
    lon: "43.0661091",
  },
  {
    city: "Светлоград",
    lat: "45.3284769",
    lon: "42.8566923",
  },
  {
    city: "Ставрополь",
    lat: "45.0445439",
    lon: "41.9690168",
  },
  {
    city: "Жердевка",
    lat: "51.8421783",
    lon: "41.4617407",
  },
  {
    city: "Кирсанов",
    lat: "52.650594",
    lon: "42.7284872",
  },
  {
    city: "Котовск",
    lat: "52.592393",
    lon: "41.5102486",
  },
  {
    city: "Мичуринск",
    lat: "52.891294",
    lon: "40.510475",
  },
  {
    city: "Моршанск",
    lat: "53.4436469",
    lon: "41.8115687",
  },
  {
    city: "Рассказово",
    lat: "52.6537517",
    lon: "41.8743779",
  },
  {
    city: "Тамбов",
    lat: "52.7213021",
    lon: "41.452258",
  },
  {
    city: "Уварово",
    lat: "51.9768835",
    lon: "42.2529568",
  },
  {
    city: "Агрыз",
    lat: "56.5232645",
    lon: "52.994257",
  },
  {
    city: "Азнакаево",
    lat: "54.8599054",
    lon: "53.0745505",
  },
  {
    city: "Альметьевск",
    lat: "54.9013662",
    lon: "52.2970654",
  },
  {
    city: "Арск",
    lat: "56.0913636",
    lon: "49.8770441",
  },
  {
    city: "Бавлы",
    lat: "54.4063588",
    lon: "53.2457946",
  },
  {
    city: "Болгар",
    lat: "54.9748862",
    lon: "49.0302977",
  },
  {
    city: "Бугульма",
    lat: "54.5363428",
    lon: "52.7895286",
  },
  {
    city: "Буинск",
    lat: "54.9641106",
    lon: "48.2900576",
  },
  {
    city: "Елабуга",
    lat: "55.7566727",
    lon: "52.0544438",
  },
  {
    city: "Заинск",
    lat: "55.2988854",
    lon: "52.0063634",
  },
  {
    city: "Зеленодольск",
    lat: "55.8466751",
    lon: "48.5010882",
  },
  {
    city: "Иннополис",
    lat: "55.7521544",
    lon: "48.7446161",
  },
  {
    city: "Казань",
    lat: "55.7943877",
    lon: "49.1115312",
  },
  {
    city: "Лаишево",
    lat: "55.4042646",
    lon: "49.5498201",
  },
  {
    city: "Лениногорск",
    lat: "54.5966917",
    lon: "52.4432118",
  },
  {
    city: "Мамадыш",
    lat: "55.7149876",
    lon: "51.4128614",
  },
  {
    city: "Менделеевск",
    lat: "55.8950646",
    lon: "52.3144177",
  },
  {
    city: "Мензелинск",
    lat: "55.7270908",
    lon: "53.1005321",
  },
  {
    city: "Набережные Челны",
    lat: "55.7436475",
    lon: "52.3958739",
  },
  {
    city: "Нижнекамск",
    lat: "55.6311963",
    lon: "51.814407",
  },
  {
    city: "Нурлат",
    lat: "54.4281578",
    lon: "50.8050431",
  },
  {
    city: "Тетюши",
    lat: "54.936575",
    lon: "48.8314915",
  },
  {
    city: "Чистополь",
    lat: "55.3699372",
    lon: "50.628495",
  },
  {
    city: "Андреаполь",
    lat: "56.6507072",
    lon: "32.2621196",
  },
  {
    city: "Бежецк",
    lat: "57.7861144",
    lon: "36.6903445",
  },
  {
    city: "Белый",
    lat: "55.8337663",
    lon: "32.9388976",
  },
  {
    city: "Бологое",
    lat: "57.885655",
    lon: "34.0536895",
  },
  {
    city: "Весьегонск",
    lat: "58.6584004",
    lon: "37.2568605",
  },
  {
    city: "Вышний Волочек",
    lat: "57.5683326",
    lon: "34.5402931",
  },
  {
    city: "Западная Двина",
    lat: "56.2568002",
    lon: "32.0805972",
  },
  {
    city: "Зубцов",
    lat: "56.1760709",
    lon: "34.5825504",
  },
  {
    city: "Калязин",
    lat: "57.2579471",
    lon: "37.7821253",
  },
  {
    city: "Кашин",
    lat: "57.3600486",
    lon: "37.6118674",
  },
  {
    city: "Кимры",
    lat: "56.873359",
    lon: "37.3557064",
  },
  {
    city: "Конаково",
    lat: "56.7275533",
    lon: "36.8011699",
  },
  {
    city: "Красный Холм",
    lat: "58.0570193",
    lon: "37.1125975",
  },
  {
    city: "Кувшиново",
    lat: "57.0263733",
    lon: "34.1676435",
  },
  {
    city: "Лихославль",
    lat: "57.122256",
    lon: "35.4667886",
  },
  {
    city: "Нелидово",
    lat: "56.2232417",
    lon: "32.7766656",
  },
  {
    city: "Осташков",
    lat: "57.1457205",
    lon: "33.1116707",
  },
  {
    city: "Ржев",
    lat: "56.2629393",
    lon: "34.3291178",
  },
  {
    city: "Старица",
    lat: "56.514955",
    lon: "34.9335145",
  },
  {
    city: "Тверь",
    lat: "56.8585396",
    lon: "35.9117898",
  },
  {
    city: "Торжок",
    lat: "57.0412804",
    lon: "34.9600691",
  },
  {
    city: "Торопец",
    lat: "56.5011791",
    lon: "31.6354366",
  },
  {
    city: "Удомля",
    lat: "57.8787885",
    lon: "35.016716",
  },
  {
    city: "Асино",
    lat: "56.9908444",
    lon: "86.1765724",
  },
  {
    city: "Кедровый",
    lat: "57.5618465",
    lon: "79.5678914",
  },
  {
    city: "Колпашево",
    lat: "58.3114716",
    lon: "82.9027528",
  },
  {
    city: "Северск",
    lat: "56.6031143",
    lon: "84.8809687",
  },
  {
    city: "Стрежевой",
    lat: "60.7328199",
    lon: "77.6040323",
  },
  {
    city: "Томск",
    lat: "56.4847036",
    lon: "84.9481737",
  },
  {
    city: "Алексин",
    lat: "54.5083788",
    lon: "37.047891",
  },
  {
    city: "Белев",
    lat: "53.8113348",
    lon: "36.1383153",
  },
  {
    city: "Богородицк",
    lat: "53.7700516",
    lon: "38.1225308",
  },
  {
    city: "Болохово",
    lat: "54.0820644",
    lon: "37.826844",
  },
  {
    city: "Венев",
    lat: "54.3542431",
    lon: "38.2642325",
  },
  {
    city: "Донской",
    lat: "53.9679582",
    lon: "38.3372104",
  },
  {
    city: "Ефремов",
    lat: "53.1465725",
    lon: "38.0922412",
  },
  {
    city: "Кимовск",
    lat: "53.9698378",
    lon: "38.5380267",
  },
  {
    city: "Киреевск",
    lat: "53.9321173",
    lon: "37.9220791",
  },
  {
    city: "Липки",
    lat: "53.9418109",
    lon: "37.7019452",
  },
  {
    city: "Новомосковск",
    lat: "54.0109754",
    lon: "38.2915652",
  },
  {
    city: "Плавск",
    lat: "53.7095993",
    lon: "37.2863144",
  },
  {
    city: "Советск",
    lat: "53.9337099",
    lon: "37.6315517",
  },
  {
    city: "Суворов",
    lat: "54.1345367",
    lon: "36.4806933",
  },
  {
    city: "Тула",
    lat: "54.192017",
    lon: "37.6153885",
  },
  {
    city: "Узловая",
    lat: "53.9731407",
    lon: "38.1763104",
  },
  {
    city: "Чекалин",
    lat: "54.0985105",
    lon: "36.2474377",
  },
  {
    city: "Щекино",
    lat: "54.0020749",
    lon: "37.517686",
  },
  {
    city: "Ясногорск",
    lat: "54.4795178",
    lon: "37.689669",
  },
  {
    city: "Ак-Довурак",
    lat: "51.1785658",
    lon: "90.5984511",
  },
  {
    city: "Кызыл",
    lat: "51.7191542",
    lon: "94.4377234",
  },
  {
    city: "Туран",
    lat: "52.144932",
    lon: "93.9172495",
  },
  {
    city: "Чадан",
    lat: "51.2844482",
    lon: "91.5789135",
  },
  {
    city: "Шагонар",
    lat: "51.5347357",
    lon: "92.9199618",
  },
  {
    city: "Заводоуковск",
    lat: "56.5012193",
    lon: "66.5505094",
  },
  {
    city: "Ишим",
    lat: "56.0952037",
    lon: "69.4643292",
  },
  {
    city: "Тобольск",
    lat: "58.2016828",
    lon: "68.2538392",
  },
  {
    city: "Тюмень",
    lat: "57.1530824",
    lon: "65.5343118",
  },
  {
    city: "Ялуторовск",
    lat: "56.649167",
    lon: "66.297034",
  },
  {
    city: "Воткинск",
    lat: "57.0517641",
    lon: "53.9874635",
  },
  {
    city: "Глазов",
    lat: "58.1359111",
    lon: "52.6634998",
  },
  {
    city: "Ижевск",
    lat: "56.8527444",
    lon: "53.2113961",
  },
  {
    city: "Камбарка",
    lat: "56.2659745",
    lon: "54.1934153",
  },
  {
    city: "Можга",
    lat: "56.4427219",
    lon: "52.2138882",
  },
  {
    city: "Сарапул",
    lat: "56.4616117",
    lon: "53.8036967",
  },
  {
    city: "Барыш",
    lat: "53.6534563",
    lon: "47.1180805",
  },
  {
    city: "Димитровград",
    lat: "54.2168446",
    lon: "49.6261645",
  },
  {
    city: "Инза",
    lat: "53.8550467",
    lon: "46.3532786",
  },
  {
    city: "Новоульяновск",
    lat: "54.1447691",
    lon: "48.3911701",
  },
  {
    city: "Сенгилей",
    lat: "53.9590553",
    lon: "48.7767869",
  },
  {
    city: "Ульяновск",
    lat: "54.3080674",
    lon: "48.3748717",
  },
  {
    city: "Амурск",
    lat: "50.2345017",
    lon: "136.8791135",
  },
  {
    city: "Бикин",
    lat: "46.8186244",
    lon: "134.2551046",
  },
  {
    city: "Вяземский",
    lat: "47.5354416",
    lon: "134.7553701",
  },
  {
    city: "Комсомольск-на-Амуре",
    lat: "50.550011",
    lon: "137.0079286",
  },
  {
    city: "Николаевск-на-Амуре",
    lat: "53.1461943",
    lon: "140.7109642",
  },
  {
    city: "Советская Гавань",
    lat: "48.9664554",
    lon: "140.2852223",
  },
  {
    city: "Хабаровск",
    lat: "48.4647991",
    lon: "135.0598811",
  },
  {
    city: "Абаза",
    lat: "52.6517296",
    lon: "90.0885929",
  },
  {
    city: "Абакан",
    lat: "53.7223661",
    lon: "91.4437792",
  },
  {
    city: "Саяногорск",
    lat: "53.1008226",
    lon: "91.4121643",
  },
  {
    city: "Сорск",
    lat: "54.0001451",
    lon: "90.2595674",
  },
  {
    city: "Черногорск",
    lat: "53.8258425",
    lon: "91.3259669",
  },
  {
    city: "Белоярский",
    lat: "63.712181",
    lon: "66.6772357",
  },
  {
    city: "Когалым",
    lat: "62.2638914",
    lon: "74.4828687",
  },
  {
    city: "Лангепас",
    lat: "61.2536667",
    lon: "75.1807905",
  },
  {
    city: "Лянтор",
    lat: "61.6391639",
    lon: "72.1793828",
  },
  {
    city: "Мегион",
    lat: "61.0318946",
    lon: "76.1024772",
  },
  {
    city: "Нефтеюганск",
    lat: "61.0882837",
    lon: "72.6164185",
  },
  {
    city: "Нижневартовск",
    lat: "60.9397379",
    lon: "76.5696206",
  },
  {
    city: "Нягань",
    lat: "62.1454839",
    lon: "65.3944361",
  },
  {
    city: "Покачи",
    lat: "61.7421977",
    lon: "75.5942069",
  },
  {
    city: "Пыть-Ях",
    lat: "60.7585769",
    lon: "72.8366445",
  },
  {
    city: "Радужный",
    lat: "62.1343067",
    lon: "77.4584346",
  },
  {
    city: "Советский",
    lat: "61.3706695",
    lon: "63.566863",
  },
  {
    city: "Сургут",
    lat: "61.2539773",
    lon: "73.3961726",
  },
  {
    city: "Урай",
    lat: "60.1295842",
    lon: "64.8040117",
  },
  {
    city: "Ханты-Мансийск",
    lat: "61.0024344",
    lon: "69.0183322",
  },
  {
    city: "Югорск",
    lat: "61.3124504",
    lon: "63.3364787",
  },
  {
    city: "Аша",
    lat: "54.9907105",
    lon: "57.2783704",
  },
  {
    city: "Бакал",
    lat: "54.9406759",
    lon: "58.8051085",
  },
  {
    city: "Верхнеуральск",
    lat: "53.8760587",
    lon: "59.2169071",
  },
  {
    city: "Верхний Уфалей",
    lat: "56.0487252",
    lon: "60.231963",
  },
  {
    city: "Еманжелинск",
    lat: "54.7554084",
    lon: "61.3243985",
  },
  {
    city: "Златоуст",
    lat: "55.1715695",
    lon: "59.6726264",
  },
  {
    city: "Карабаш",
    lat: "55.4852076",
    lon: "60.2358959",
  },
  {
    city: "Карталы",
    lat: "53.0536101",
    lon: "60.647712",
  },
  {
    city: "Касли",
    lat: "55.8868045",
    lon: "60.7422529",
  },
  {
    city: "Катав-Ивановск",
    lat: "54.7520187",
    lon: "58.1983706",
  },
  {
    city: "Копейск",
    lat: "55.1167545",
    lon: "61.6180809",
  },
  {
    city: "Коркино",
    lat: "54.8903023",
    lon: "61.4034541",
  },
  {
    city: "Куса",
    lat: "55.3385156",
    lon: "59.4386474",
  },
  {
    city: "Кыштым",
    lat: "55.7060048",
    lon: "60.5563271",
  },
  {
    city: "Магнитогорск",
    lat: "53.4071891",
    lon: "58.9791432",
  },
  {
    city: "Миасс",
    lat: "55.0455774",
    lon: "60.1077757",
  },
  {
    city: "Миньяр",
    lat: "55.0709601",
    lon: "57.5484435",
  },
  {
    city: "Нязепетровск",
    lat: "56.0537199",
    lon: "59.6096791",
  },
  {
    city: "Озерск",
    lat: "55.7631922",
    lon: "60.7076337",
  },
  {
    city: "Пласт",
    lat: "54.3691832",
    lon: "60.8152305",
  },
  {
    city: "Сатка",
    lat: "55.0404497",
    lon: "59.0288153",
  },
  {
    city: "Сим",
    lat: "54.9906584",
    lon: "57.6899045",
  },
  {
    city: "Снежинск",
    lat: "56.085232",
    lon: "60.7324989",
  },
  {
    city: "Трехгорный",
    lat: "54.8178174",
    lon: "58.4465039",
  },
  {
    city: "Троицк",
    lat: "54.0844132",
    lon: "61.5585503",
  },
  {
    city: "Усть-Катав",
    lat: "54.9261323",
    lon: "58.1528067",
  },
  {
    city: "Чебаркуль",
    lat: "54.9819329",
    lon: "60.3773305",
  },
  {
    city: "Челябинск",
    lat: "55.1603659",
    lon: "61.4007858",
  },
  {
    city: "Южноуральск",
    lat: "54.4490124",
    lon: "61.2581869",
  },
  {
    city: "Юрюзань",
    lat: "54.8546372",
    lon: "58.4227116",
  },
  {
    city: "Аргун",
    lat: "43.2918071",
    lon: "45.8724383",
  },
  {
    city: "Грозный",
    lat: "43.3179243",
    lon: "45.6981102",
  },
  {
    city: "Гудермес",
    lat: "43.3519164",
    lon: "46.1036052",
  },
  {
    city: null,
    lat: null,
    lon: null,
  },
  {
    city: "Шали",
    lat: "43.148776",
    lon: "45.9009577",
  },
  {
    city: "Алатырь",
    lat: "54.8398179",
    lon: "46.5721423",
  },
  {
    city: "Канаш",
    lat: "55.5069543",
    lon: "47.4917734",
  },
  {
    city: "Козловка",
    lat: "55.8406526",
    lon: "48.2579372",
  },
  {
    city: "Мариинский Посад",
    lat: "56.111968",
    lon: "47.7142676",
  },
  {
    city: "Новочебоксарск",
    lat: "56.109486",
    lon: "47.4791429",
  },
  {
    city: "Цивильск",
    lat: "55.8650132",
    lon: "47.472967",
  },
  {
    city: "Чебоксары",
    lat: "56.1439378",
    lon: "47.2488718",
  },
  {
    city: "Шумерля",
    lat: "55.4961795",
    lon: "46.4183534",
  },
  {
    city: "Ядрин",
    lat: "55.9406826",
    lon: "46.2020765",
  },
  {
    city: "Анадырь",
    lat: "64.7314347",
    lon: "177.5015752",
  },
  {
    city: "Билибино",
    lat: "68.0585533",
    lon: "166.4388451",
  },
  {
    city: "Певек",
    lat: "69.7018051",
    lon: "170.2999194",
  },
  {
    city: "Алдан",
    lat: "58.6094885",
    lon: "125.3816689",
  },
  {
    city: "Верхоянск",
    lat: "67.5500865",
    lon: "133.3907829",
  },
  {
    city: "Вилюйск",
    lat: "63.7517314",
    lon: "121.6272754",
  },
  {
    city: "Ленск",
    lat: "60.7276036",
    lon: "114.9549103",
  },
  {
    city: "Мирный",
    lat: "62.5362511",
    lon: "113.9668146",
  },
  {
    city: "Нерюнгри",
    lat: "56.6600322",
    lon: "124.72031",
  },
  {
    city: "Нюрба",
    lat: "63.2828775",
    lon: "118.324325",
  },
  {
    city: "Олекминск",
    lat: "60.3758203",
    lon: "120.406013",
  },
  {
    city: "Покровск",
    lat: "61.4843538",
    lon: "129.1482195",
  },
  {
    city: "Среднеколымск",
    lat: "67.4581664",
    lon: "153.7069511",
  },
  {
    city: "Томмот",
    lat: "58.9586939",
    lon: "126.2875375",
  },
  {
    city: "Удачный",
    lat: "66.4072367",
    lon: "112.3061653",
  },
  {
    city: "Якутск",
    lat: "62.0280273",
    lon: "129.7325717",
  },
  {
    city: "Губкинский",
    lat: "64.4456575",
    lon: "76.4714559",
  },
  {
    city: "Лабытнанги",
    lat: "66.6592376",
    lon: "66.3882628",
  },
  {
    city: "Муравленко",
    lat: "63.794188",
    lon: "74.494913",
  },
  {
    city: "Надым",
    lat: "65.5377514",
    lon: "72.5182746",
  },
  {
    city: "Новый Уренгой",
    lat: "66.0840036",
    lon: "76.6810032",
  },
  {
    city: "Ноябрьск",
    lat: "63.201846",
    lon: "75.4509665",
  },
  {
    city: "Салехард",
    lat: "66.5493568",
    lon: "66.6083994",
  },
  {
    city: "Тарко-Сале",
    lat: "64.9117649",
    lon: "77.7610204",
  },
  {
    city: "Гаврилов-Ям",
    lat: "57.3091552",
    lon: "39.8545157",
  },
  {
    city: "Данилов",
    lat: "58.1859542",
    lon: "40.1796765",
  },
  {
    city: "Любим",
    lat: "58.3619868",
    lon: "40.6869581",
  },
  {
    city: "Мышкин",
    lat: "57.7881664",
    lon: "38.4542816",
  },
  {
    city: "Переславль-Залесский",
    lat: "56.7360435",
    lon: "38.8543064",
  },
  {
    city: "Пошехонье",
    lat: "58.506328",
    lon: "39.1210034",
  },
  {
    city: "Ростов",
    lat: "57.2050177",
    lon: "39.4378357",
  },
  {
    city: "Рыбинск",
    lat: "58.0483802",
    lon: "38.858338",
  },
  {
    city: "Тутаев",
    lat: "57.8674237",
    lon: "39.5368234",
  },
  {
    city: "Углич",
    lat: "57.5223866",
    lon: "38.3019793",
  },
  {
    city: "Ярославль",
    lat: "57.6216145",
    lon: "39.897878",
  },
];
